OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PA.5 MFP */
#define SYS_GPA_MFP1_PA5MFP_GPIO              (0x0UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for GPIO               */
#define SYS_GPA_MFP1_PA5MFP_QSPI0_MISO1       (0x3UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for QSPI0_MISO1        */
#define SYS_GPA_MFP1_PA5MFP_SPI1_I2SMCLK      (0x4UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for SPI1_I2SMCLK       */
#define SYS_GPA_MFP1_PA5MFP_SD1_CMD           (0x5UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for SD1_CMD            */
#define SYS_GPA_MFP1_PA5MFP_SC2_nCD           (0x6UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for SC2_nCD            */
#define SYS_GPA_MFP1_PA5MFP_UART0_nCTS        (0x7UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for UART0_nCTS         */
#define SYS_GPA_MFP1_PA5MFP_UART5_TXD         (0x8UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for UART5_TXD          */
#define SYS_GPA_MFP1_PA5MFP_I2C0_SCL          (0x9UL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for I2C0_SCL           */
#define SYS_GPA_MFP1_PA5MFP_CAN0_TXD          (0xAUL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for CAN0_TXD           */
#define SYS_GPA_MFP1_PA5MFP_UART0_TXD         (0xBUL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for UART0_TXD          */
#define SYS_GPA_MFP1_PA5MFP_BPWM0_CH5         (0xCUL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for BPWM0_CH5          */
#define SYS_GPA_MFP1_PA5MFP_EPWM0_CH0         (0xDUL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for EPWM0_CH0          */
#define SYS_GPA_MFP1_PA5MFP_EQEI0_INDEX       (0xEUL<<SYS_GPA_MFP1_PA5MFP_Pos)    /*!< GPA_MFP1 PA5 setting for EQEI0_INDEX        */
#define SYS_GPA_MFP1_PA5MFP_DMIC0_DAT         (0x10UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for DMIC0_DAT          */
#define SYS_GPA_MFP1_PA5MFP_I3C0_SCL          (0x11UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for I3C0_SCL           */
#define SYS_GPA_MFP1_PA5MFP_UTCPD0_VBSNKEN    (0x13UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for UTCPD0_VBSNKEN     */
#define SYS_GPA_MFP1_PA5MFP_LPUART0_TXD       (0x14UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for LPUART0_TXD        */
#define SYS_GPA_MFP1_PA5MFP_LPUART0_nCTS      (0x15UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for LPUART0_nCTS       */
#define SYS_GPA_MFP1_PA5MFP_LPI2C0_SCL        (0x16UL<<SYS_GPA_MFP1_PA5MFP_Pos)   /*!< GPA_MFP1 PA5 setting for LPI2C0_SCL         */

/* PA.6 MFP */
#define SYS_GPA_MFP1_PA6MFP_GPIO              (0x0UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for GPIO               */
#define SYS_GPA_MFP1_PA6MFP_UTCPD0_DISCHG     (0x2UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for UTCPD0_DISCHG      */
#define SYS_GPA_MFP1_PA6MFP_EMAC0_RMII_RXERR  (0x3UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for EMAC0_RMII_RXERR   */
#define SYS_GPA_MFP1_PA6MFP_SPI1_SS           (0x4UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for SPI1_SS            */
#define SYS_GPA_MFP1_PA6MFP_SD1_nCD           (0x5UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for SD1_nCD            */
#define SYS_GPA_MFP1_PA6MFP_SC2_CLK           (0x6UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for SC2_CLK            */
#define SYS_GPA_MFP1_PA6MFP_UART0_RXD         (0x7UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for UART0_RXD          */
#define SYS_GPA_MFP1_PA6MFP_I2C1_SDA          (0x8UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for I2C1_SDA           */
#define SYS_GPA_MFP1_PA6MFP_QSPI1_MOSI1       (0x9UL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for QSPI1_MOSI1        */
#define SYS_GPA_MFP1_PA6MFP_EPWM1_CH5         (0xBUL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for EPWM1_CH5          */
#define SYS_GPA_MFP1_PA6MFP_BPWM1_CH3         (0xCUL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for BPWM1_CH3          */
#define SYS_GPA_MFP1_PA6MFP_ACMP1_WLAT        (0xDUL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for ACMP1_WLAT         */
#define SYS_GPA_MFP1_PA6MFP_TM3               (0xEUL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for TM3                */
#define SYS_GPA_MFP1_PA6MFP_INT0              (0xFUL<<SYS_GPA_MFP1_PA6MFP_Pos)    /*!< GPA_MFP1 PA6 setting for INT0               */
#define SYS_GPA_MFP1_PA6MFP_UTCPD0_VBSRCEN    (0x11UL<<SYS_GPA_MFP1_PA6MFP_Pos)   /*!< GPA_MFP1 PA6 setting for UTCPD0_VBSRCEN     */
#define SYS_GPA_MFP1_PA6MFP_KPI_COL0          (0x12UL<<SYS_GPA_MFP1_PA6MFP_Pos)   /*!< GPA_MFP1 PA6 setting for KPI_COL0           */
#define SYS_GPA_MFP1_PA6MFP_LPUART0_RXD       (0x15UL<<SYS_GPA_MFP1_PA6MFP_Pos)   /*!< GPA_MFP1 PA6 setting for LPUART0_RXD        */
#define SYS_GPA_MFP1_PA6MFP_LPIO4             (0x17UL<<SYS_GPA_MFP1_PA6MFP_Pos)   /*!< GPA_MFP1 PA6 setting for LPIO4              */

/* PA.7 MFP */
#define SYS_GPA_MFP1_PA7MFP_GPIO              (0x0UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for GPIO               */
#define SYS_GPA_MFP1_PA7MFP_EBI_AD7           (0x2UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for EBI_AD7            */
#define SYS_GPA_MFP1_PA7MFP_EMAC0_RMII_CRSDV  (0x3UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for EMAC0_RMII_CRSDV   */
#define SYS_GPA_MFP1_PA7MFP_SPI1_CLK          (0x4UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for SPI1_CLK           */
#define SYS_GPA_MFP1_PA7MFP_SC2_DAT           (0x6UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for SC2_DAT            */
#define SYS_GPA_MFP1_PA7MFP_UART0_TXD         (0x7UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for UART0_TXD          */
#define SYS_GPA_MFP1_PA7MFP_I2C1_SCL          (0x8UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for I2C1_SCL           */
#define SYS_GPA_MFP1_PA7MFP_QSPI1_MISO1       (0x9UL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for QSPI1_MISO1        */
#define SYS_GPA_MFP1_PA7MFP_EPWM1_CH4         (0xBUL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for EPWM1_CH4          */
#define SYS_GPA_MFP1_PA7MFP_BPWM1_CH2         (0xCUL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for BPWM1_CH2          */
#define SYS_GPA_MFP1_PA7MFP_ACMP0_WLAT        (0xDUL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for ACMP0_WLAT         */
#define SYS_GPA_MFP1_PA7MFP_TM2               (0xEUL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for TM2                */
#define SYS_GPA_MFP1_PA7MFP_INT1              (0xFUL<<SYS_GPA_MFP1_PA7MFP_Pos)    /*!< GPA_MFP1 PA7 setting for INT1               */
#define SYS_GPA_MFP1_PA7MFP_UTCPD0_VBSNKEN    (0x11UL<<SYS_GPA_MFP1_PA7MFP_Pos)   /*!< GPA_MFP1 PA7 setting for UTCPD0_VBSNKEN     */
#define SYS_GPA_MFP1_PA7MFP_KPI_COL1          (0x12UL<<SYS_GPA_MFP1_PA7MFP_Pos)   /*!< GPA_MFP1 PA7 setting for KPI_COL1           */
#define SYS_GPA_MFP1_PA7MFP_LPUART0_TXD       (0x15UL<<SYS_GPA_MFP1_PA7MFP_Pos)   /*!< GPA_MFP1 PA7 setting for LPUART0_TXD        */
#define SYS_GPA_MFP1_PA7MFP_LPIO5             (0x17UL<<SYS_GPA_MFP1_PA7MFP_Pos)   /*!< GPA_MFP1 PA7 setting for LPIO5              */

/* PA.8 MFP */
#define SYS_GPA_MFP2_PA8MFP_GPIO              (0x0UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for GPIO               */
#define SYS_GPA_MFP2_PA8MFP_EADC0_CH20        (0x1UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for EADC0_CH20         */
#define SYS_GPA_MFP2_PA8MFP_EADC1_CH4         (0x1UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for EADC1_CH4          */
#define SYS_GPA_MFP2_PA8MFP_LPADC0_CH20       (0x1UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for LPADC0_CH20        */
#define SYS_GPA_MFP2_PA8MFP_EBI_ALE           (0x2UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for EBI_ALE            */
#define SYS_GPA_MFP2_PA8MFP_SC2_CLK           (0x3UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for SC2_CLK            */
#define SYS_GPA_MFP2_PA8MFP_SPI2_MOSI         (0x4UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for SPI2_MOSI          */
#define SYS_GPA_MFP2_PA8MFP_SD1_DAT0          (0x5UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for SD1_DAT0           */
#define SYS_GPA_MFP2_PA8MFP_USCI0_CTL1        (0x6UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for USCI0_CTL1         */
#define SYS_GPA_MFP2_PA8MFP_UART1_RXD         (0x7UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for UART1_RXD          */
#define SYS_GPA_MFP2_PA8MFP_UART7_RXD         (0x8UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for UART7_RXD          */
#define SYS_GPA_MFP2_PA8MFP_BPWM0_CH3         (0x9UL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for BPWM0_CH3          */
#define SYS_GPA_MFP2_PA8MFP_EQEI1_B           (0xAUL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for EQEI1_B            */
#define SYS_GPA_MFP2_PA8MFP_ECAP0_IC2         (0xBUL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for ECAP0_IC2          */
#define SYS_GPA_MFP2_PA8MFP_I2S1_DO           (0xCUL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for I2S1_DO            */
#define SYS_GPA_MFP2_PA8MFP_TM3_EXT           (0xDUL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for TM3_EXT            */
#define SYS_GPA_MFP2_PA8MFP_INT4              (0xFUL<<SYS_GPA_MFP2_PA8MFP_Pos)    /*!< GPA_MFP2 PA8 setting for INT4               */

/* PA.9 MFP */
#define SYS_GPA_MFP2_PA9MFP_GPIO              (0x0UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for GPIO               */
#define SYS_GPA_MFP2_PA9MFP_EADC0_CH21        (0x1UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for EADC0_CH21         */
#define SYS_GPA_MFP2_PA9MFP_EADC1_CH5         (0x1UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for EADC1_CH5          */
#define SYS_GPA_MFP2_PA9MFP_LPADC0_CH21       (0x1UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for LPADC0_CH21        */
#define SYS_GPA_MFP2_PA9MFP_EBI_MCLK          (0x2UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for EBI_MCLK           */
#define SYS_GPA_MFP2_PA9MFP_SC2_DAT           (0x3UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for SC2_DAT            */
#define SYS_GPA_MFP2_PA9MFP_SPI2_MISO         (0x4UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for SPI2_MISO          */
#define SYS_GPA_MFP2_PA9MFP_SD1_DAT1          (0x5UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for SD1_DAT1           */
#define SYS_GPA_MFP2_PA9MFP_USCI0_DAT1        (0x6UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for USCI0_DAT1         */
#define SYS_GPA_MFP2_PA9MFP_UART1_TXD         (0x7UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for UART1_TXD          */
#define SYS_GPA_MFP2_PA9MFP_UART7_TXD         (0x8UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for UART7_TXD          */
#define SYS_GPA_MFP2_PA9MFP_BPWM0_CH2         (0x9UL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for BPWM0_CH2          */
#define SYS_GPA_MFP2_PA9MFP_EQEI1_A           (0xAUL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for EQEI1_A            */
#define SYS_GPA_MFP2_PA9MFP_ECAP0_IC1         (0xBUL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for ECAP0_IC1          */
#define SYS_GPA_MFP2_PA9MFP_I2S1_DI           (0xCUL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for I2S1_DI            */
#define SYS_GPA_MFP2_PA9MFP_TM2_EXT           (0xDUL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for TM2_EXT            */
#define SYS_GPA_MFP2_PA9MFP_SWDH_DAT          (0xFUL<<SYS_GPA_MFP2_PA9MFP_Pos)    /*!< GPA_MFP2 PA9 setting for SWDH_DAT           */

/* PA.10 MFP */
#define SYS_GPA_MFP2_PA10MFP_GPIO             (0x0UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for GPIO              */
#define SYS_GPA_MFP2_PA10MFP_ACMP1_P0         (0x1UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for ACMP1_P0          */
#define SYS_GPA_MFP2_PA10MFP_EADC0_CH22       (0x1UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for EADC0_CH22        */
#define SYS_GPA_MFP2_PA10MFP_EADC1_CH6        (0x1UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for EADC1_CH6         */
#define SYS_GPA_MFP2_PA10MFP_LPADC0_CH22      (0x1UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for LPADC0_CH22       */
#define SYS_GPA_MFP2_PA10MFP_EBI_nWR          (0x2UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for EBI_nWR           */
#define SYS_GPA_MFP2_PA10MFP_SC2_RST          (0x3UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for SC2_RST           */
#define SYS_GPA_MFP2_PA10MFP_SPI2_CLK         (0x4UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for SPI2_CLK          */
#define SYS_GPA_MFP2_PA10MFP_SD1_DAT2         (0x5UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for SD1_DAT2          */
#define SYS_GPA_MFP2_PA10MFP_USCI0_DAT0       (0x6UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for USCI0_DAT0        */
#define SYS_GPA_MFP2_PA10MFP_I2C2_SDA         (0x7UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for I2C2_SDA          */
#define SYS_GPA_MFP2_PA10MFP_UART6_RXD        (0x8UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for UART6_RXD         */
#define SYS_GPA_MFP2_PA10MFP_BPWM0_CH1        (0x9UL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for BPWM0_CH1         */
#define SYS_GPA_MFP2_PA10MFP_EQEI1_INDEX      (0xAUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for EQEI1_INDEX       */
#define SYS_GPA_MFP2_PA10MFP_ECAP0_IC0        (0xBUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for ECAP0_IC0         */
#define SYS_GPA_MFP2_PA10MFP_I2S1_MCLK        (0xCUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for I2S1_MCLK         */
#define SYS_GPA_MFP2_PA10MFP_TM1_EXT          (0xDUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for TM1_EXT           */
#define SYS_GPA_MFP2_PA10MFP_DAC0_ST          (0xEUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for DAC0_ST           */
#define SYS_GPA_MFP2_PA10MFP_SWDH_CLK         (0xFUL<<SYS_GPA_MFP2_PA10MFP_Pos)   /*!< GPA_MFP2 PA10 setting for SWDH_CLK          */
#define SYS_GPA_MFP2_PA10MFP_KPI_ROW5         (0x12UL<<SYS_GPA_MFP2_PA10MFP_Pos)  /*!< GPA_MFP2 PA10 setting for KPI_ROW5          */
#define SYS_GPA_MFP2_PA10MFP_LPTM1_EXT        (0x17UL<<SYS_GPA_MFP2_PA10MFP_Pos)  /*!< GPA_MFP2 PA10 setting for LPTM1_EXT         */

