OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PA.11 MFP */
#define SYS_GPA_MFP2_PA11MFP_GPIO             (0x0UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for GPIO              */
#define SYS_GPA_MFP2_PA11MFP_ACMP0_P0         (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for ACMP0_P0          */
#define SYS_GPA_MFP2_PA11MFP_EADC0_CH23       (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EADC0_CH23        */
#define SYS_GPA_MFP2_PA11MFP_EADC1_CH7        (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EADC1_CH7         */
#define SYS_GPA_MFP2_PA11MFP_LPADC0_CH23      (0x1UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for LPADC0_CH23       */
#define SYS_GPA_MFP2_PA11MFP_EBI_nRD          (0x2UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EBI_nRD           */
#define SYS_GPA_MFP2_PA11MFP_SC2_PWR          (0x3UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for SC2_PWR           */
#define SYS_GPA_MFP2_PA11MFP_SPI2_SS          (0x4UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for SPI2_SS           */
#define SYS_GPA_MFP2_PA11MFP_SD1_DAT3         (0x5UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for SD1_DAT3          */
#define SYS_GPA_MFP2_PA11MFP_USCI0_CLK        (0x6UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for USCI0_CLK         */
#define SYS_GPA_MFP2_PA11MFP_I2C2_SCL         (0x7UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for I2C2_SCL          */
#define SYS_GPA_MFP2_PA11MFP_UART6_TXD        (0x8UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for UART6_TXD         */
#define SYS_GPA_MFP2_PA11MFP_BPWM0_CH0        (0x9UL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for BPWM0_CH0         */
#define SYS_GPA_MFP2_PA11MFP_EPWM0_SYNC_OUT   (0xAUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EPWM0_SYNC_OUT    */
#define SYS_GPA_MFP2_PA11MFP_EPWM0_BRAKE1     (0xBUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for EPWM0_BRAKE1      */
#define SYS_GPA_MFP2_PA11MFP_I2S1_BCLK        (0xCUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for I2S1_BCLK         */
#define SYS_GPA_MFP2_PA11MFP_TM0_EXT          (0xDUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for TM0_EXT           */
#define SYS_GPA_MFP2_PA11MFP_DAC1_ST          (0xEUL<<SYS_GPA_MFP2_PA11MFP_Pos)   /*!< GPA_MFP2 PA11 setting for DAC1_ST           */
#define SYS_GPA_MFP2_PA11MFP_KPI_ROW4         (0x12UL<<SYS_GPA_MFP2_PA11MFP_Pos)  /*!< GPA_MFP2 PA11 setting for KPI_ROW4          */
#define SYS_GPA_MFP2_PA11MFP_LPTM0_EXT        (0x17UL<<SYS_GPA_MFP2_PA11MFP_Pos)  /*!< GPA_MFP2 PA11 setting for LPTM0_EXT         */

/* PA.12 MFP */
#define SYS_GPA_MFP3_PA12MFP_GPIO             (0x0UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for GPIO              */
#define SYS_GPA_MFP3_PA12MFP_I2S0_BCLK        (0x2UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for I2S0_BCLK         */
#define SYS_GPA_MFP3_PA12MFP_UART4_TXD        (0x3UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for UART4_TXD         */
#define SYS_GPA_MFP3_PA12MFP_I2C1_SCL         (0x4UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for I2C1_SCL          */
#define SYS_GPA_MFP3_PA12MFP_SPI2_SS          (0x5UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for SPI2_SS           */
#define SYS_GPA_MFP3_PA12MFP_CAN0_TXD         (0x6UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for CAN0_TXD          */
#define SYS_GPA_MFP3_PA12MFP_SC2_PWR          (0x7UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for SC2_PWR           */
#define SYS_GPA_MFP3_PA12MFP_SD1_nCD          (0x8UL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for SD1_nCD           */
#define SYS_GPA_MFP3_PA12MFP_QSPI1_MISO0      (0xAUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for QSPI1_MISO0       */
#define SYS_GPA_MFP3_PA12MFP_BPWM1_CH2        (0xBUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for BPWM1_CH2         */
#define SYS_GPA_MFP3_PA12MFP_EQEI1_INDEX      (0xCUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for EQEI1_INDEX       */
#define SYS_GPA_MFP3_PA12MFP_ECAP3_IC0        (0xDUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for ECAP3_IC0         */
#define SYS_GPA_MFP3_PA12MFP_USB_VBUS         (0xEUL<<SYS_GPA_MFP3_PA12MFP_Pos)   /*!< GPA_MFP3 PA12 setting for USB_VBUS          */
#define SYS_GPA_MFP3_PA12MFP_PSIO0_CH4        (0x11UL<<SYS_GPA_MFP3_PA12MFP_Pos)  /*!< GPA_MFP3 PA12 setting for PSIO0_CH4         */
#define SYS_GPA_MFP3_PA12MFP_LPSPI0_SS        (0x14UL<<SYS_GPA_MFP3_PA12MFP_Pos)  /*!< GPA_MFP3 PA12 setting for LPSPI0_SS         */

/* PA.13 MFP */
#define SYS_GPA_MFP3_PA13MFP_GPIO             (0x0UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for GPIO              */
#define SYS_GPA_MFP3_PA13MFP_I2S0_MCLK        (0x2UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for I2S0_MCLK         */
#define SYS_GPA_MFP3_PA13MFP_UART4_RXD        (0x3UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for UART4_RXD         */
#define SYS_GPA_MFP3_PA13MFP_I2C1_SDA         (0x4UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for I2C1_SDA          */
#define SYS_GPA_MFP3_PA13MFP_SPI2_CLK         (0x5UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for SPI2_CLK          */
#define SYS_GPA_MFP3_PA13MFP_CAN0_RXD         (0x6UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for CAN0_RXD          */
#define SYS_GPA_MFP3_PA13MFP_SC2_RST          (0x7UL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for SC2_RST           */
#define SYS_GPA_MFP3_PA13MFP_QSPI1_MOSI0      (0xAUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for QSPI1_MOSI0       */
#define SYS_GPA_MFP3_PA13MFP_BPWM1_CH3        (0xBUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for BPWM1_CH3         */
#define SYS_GPA_MFP3_PA13MFP_EQEI1_A          (0xCUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for EQEI1_A           */
#define SYS_GPA_MFP3_PA13MFP_ECAP3_IC1        (0xDUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for ECAP3_IC1         */
#define SYS_GPA_MFP3_PA13MFP_USB_D_MINUS      (0xEUL<<SYS_GPA_MFP3_PA13MFP_Pos)   /*!< GPA_MFP3 PA13 setting for USB_D_MINUS       */
#define SYS_GPA_MFP3_PA13MFP_PSIO0_CH5        (0x11UL<<SYS_GPA_MFP3_PA13MFP_Pos)  /*!< GPA_MFP3 PA13 setting for PSIO0_CH5         */
#define SYS_GPA_MFP3_PA13MFP_LPSPI0_CLK       (0x14UL<<SYS_GPA_MFP3_PA13MFP_Pos)  /*!< GPA_MFP3 PA13 setting for LPSPI0_CLK        */

