OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PA.14 MFP */
#define SYS_GPA_MFP3_PA14MFP_GPIO             (0x0UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for GPIO              */
#define SYS_GPA_MFP3_PA14MFP_I2S0_DI          (0x2UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for I2S0_DI           */
#define SYS_GPA_MFP3_PA14MFP_UART0_TXD        (0x3UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for UART0_TXD         */
#define SYS_GPA_MFP3_PA14MFP_EBI_AD5          (0x4UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for EBI_AD5           */
#define SYS_GPA_MFP3_PA14MFP_SPI2_MISO        (0x5UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for SPI2_MISO         */
#define SYS_GPA_MFP3_PA14MFP_I2C2_SCL         (0x6UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for I2C2_SCL          */
#define SYS_GPA_MFP3_PA14MFP_SC2_DAT          (0x7UL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for SC2_DAT           */
#define SYS_GPA_MFP3_PA14MFP_BPWM1_CH4        (0xBUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for BPWM1_CH4         */
#define SYS_GPA_MFP3_PA14MFP_EQEI1_B          (0xCUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for EQEI1_B           */
#define SYS_GPA_MFP3_PA14MFP_ECAP3_IC2        (0xDUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for ECAP3_IC2         */
#define SYS_GPA_MFP3_PA14MFP_USB_D_PLUS       (0xEUL<<SYS_GPA_MFP3_PA14MFP_Pos)   /*!< GPA_MFP3 PA14 setting for USB_D_PLUS        */
#define SYS_GPA_MFP3_PA14MFP_PSIO0_CH6        (0x11UL<<SYS_GPA_MFP3_PA14MFP_Pos)  /*!< GPA_MFP3 PA14 setting for PSIO0_CH6         */
#define SYS_GPA_MFP3_PA14MFP_LPSPI0_MISO      (0x14UL<<SYS_GPA_MFP3_PA14MFP_Pos)  /*!< GPA_MFP3 PA14 setting for LPSPI0_MISO       */

/* PA.15 MFP */
#define SYS_GPA_MFP3_PA15MFP_GPIO             (0x0UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for GPIO              */
#define SYS_GPA_MFP3_PA15MFP_I2S0_DO          (0x2UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for I2S0_DO           */
#define SYS_GPA_MFP3_PA15MFP_UART0_RXD        (0x3UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for UART0_RXD         */
#define SYS_GPA_MFP3_PA15MFP_SPI2_MOSI        (0x5UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for SPI2_MOSI         */
#define SYS_GPA_MFP3_PA15MFP_I2C2_SDA         (0x6UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for I2C2_SDA          */
#define SYS_GPA_MFP3_PA15MFP_SC2_CLK          (0x7UL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for SC2_CLK           */
#define SYS_GPA_MFP3_PA15MFP_BPWM1_CH5        (0xBUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for BPWM1_CH5         */
#define SYS_GPA_MFP3_PA15MFP_EPWM0_SYNC_IN    (0xCUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for EPWM0_SYNC_IN     */
#define SYS_GPA_MFP3_PA15MFP_EQEI3_INDEX      (0xDUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for EQEI3_INDEX       */
#define SYS_GPA_MFP3_PA15MFP_USB_OTG_ID       (0xEUL<<SYS_GPA_MFP3_PA15MFP_Pos)   /*!< GPA_MFP3 PA15 setting for USB_OTG_ID        */
#define SYS_GPA_MFP3_PA15MFP_PSIO0_CH7        (0x11UL<<SYS_GPA_MFP3_PA15MFP_Pos)  /*!< GPA_MFP3 PA15 setting for PSIO0_CH7         */
#define SYS_GPA_MFP3_PA15MFP_LPSPI0_MOSI      (0x14UL<<SYS_GPA_MFP3_PA15MFP_Pos)  /*!< GPA_MFP3 PA15 setting for LPSPI0_MOSI       */

/* PB.0 MFP */
#define SYS_GPB_MFP0_PB0MFP_GPIO              (0x0UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for GPIO               */
#define SYS_GPB_MFP0_PB0MFP_ACMP3_N           (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for ACMP3_N            */
#define SYS_GPB_MFP0_PB0MFP_EADC0_CH0         (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EADC0_CH0          */
#define SYS_GPB_MFP0_PB0MFP_EADC1_CH8         (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EADC1_CH8          */
#define SYS_GPB_MFP0_PB0MFP_LPADC0_CH0        (0x1UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for LPADC0_CH0         */
#define SYS_GPB_MFP0_PB0MFP_EBI_ADR9          (0x2UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EBI_ADR9           */
#define SYS_GPB_MFP0_PB0MFP_SD0_CMD           (0x3UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for SD0_CMD            */
#define SYS_GPB_MFP0_PB0MFP_SPI2_I2SMCLK      (0x4UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for SPI2_I2SMCLK       */
#define SYS_GPB_MFP0_PB0MFP_USCI0_CTL0        (0x6UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for USCI0_CTL0         */
#define SYS_GPB_MFP0_PB0MFP_UART2_RXD         (0x7UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for UART2_RXD          */
#define SYS_GPB_MFP0_PB0MFP_SPI0_I2SMCLK      (0x8UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for SPI0_I2SMCLK       */
#define SYS_GPB_MFP0_PB0MFP_I2C1_SDA          (0x9UL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for I2C1_SDA           */
#define SYS_GPB_MFP0_PB0MFP_I2S1_LRCK         (0xAUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for I2S1_LRCK          */
#define SYS_GPB_MFP0_PB0MFP_EPWM0_CH5         (0xBUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM0_CH5          */
#define SYS_GPB_MFP0_PB0MFP_EPWM1_CH5         (0xCUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM1_CH5          */
#define SYS_GPB_MFP0_PB0MFP_EPWM0_BRAKE1      (0xDUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for EPWM0_BRAKE1       */
#define SYS_GPB_MFP0_PB0MFP_ACMP3_O           (0xEUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for ACMP3_O            */
#define SYS_GPB_MFP0_PB0MFP_QSPI0_MOSI1       (0xFUL<<SYS_GPB_MFP0_PB0MFP_Pos)    /*!< GPB_MFP0 PB0 setting for QSPI0_MOSI1        */
#define SYS_GPB_MFP0_PB0MFP_I3C0_SDA          (0x10UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for I3C0_SDA           */
#define SYS_GPB_MFP0_PB0MFP_UTCPD0_VCNEN2     (0x11UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for UTCPD0_VCNEN2      */
#define SYS_GPB_MFP0_PB0MFP_KPI_ROW3          (0x12UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for KPI_ROW3           */
#define SYS_GPB_MFP0_PB0MFP_LPIO2             (0x17UL<<SYS_GPB_MFP0_PB0MFP_Pos)   /*!< GPB_MFP0 PB0 setting for LPIO2              */

/* PB.1 MFP */
#define SYS_GPB_MFP0_PB1MFP_GPIO              (0x0UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for GPIO               */
#define SYS_GPB_MFP0_PB1MFP_ACMP3_P0          (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for ACMP3_P0           */
#define SYS_GPB_MFP0_PB1MFP_EADC0_CH1         (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EADC0_CH1          */
#define SYS_GPB_MFP0_PB1MFP_EADC1_CH9         (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EADC1_CH9          */
#define SYS_GPB_MFP0_PB1MFP_LPADC0_CH1        (0x1UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for LPADC0_CH1         */
#define SYS_GPB_MFP0_PB1MFP_EBI_ADR8          (0x2UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EBI_ADR8           */
#define SYS_GPB_MFP0_PB1MFP_SD0_CLK           (0x3UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for SD0_CLK            */
#define SYS_GPB_MFP0_PB1MFP_EMAC0_RMII_RXERR  (0x4UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EMAC0_RMII_RXERR   */
#define SYS_GPB_MFP0_PB1MFP_SPI1_I2SMCLK      (0x5UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for SPI1_I2SMCLK       */
#define SYS_GPB_MFP0_PB1MFP_SPI3_I2SMCLK      (0x6UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for SPI3_I2SMCLK       */
#define SYS_GPB_MFP0_PB1MFP_UART2_TXD         (0x7UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for UART2_TXD          */
#define SYS_GPB_MFP0_PB1MFP_I2C1_SCL          (0x9UL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for I2C1_SCL           */
#define SYS_GPB_MFP0_PB1MFP_I2S0_LRCK         (0xAUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for I2S0_LRCK          */
#define SYS_GPB_MFP0_PB1MFP_EPWM0_CH4         (0xBUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM0_CH4          */
#define SYS_GPB_MFP0_PB1MFP_EPWM1_CH4         (0xCUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM1_CH4          */
#define SYS_GPB_MFP0_PB1MFP_EPWM0_BRAKE0      (0xDUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for EPWM0_BRAKE0       */
#define SYS_GPB_MFP0_PB1MFP_ACMP2_O           (0xEUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for ACMP2_O            */
#define SYS_GPB_MFP0_PB1MFP_QSPI0_MISO1       (0xFUL<<SYS_GPB_MFP0_PB1MFP_Pos)    /*!< GPB_MFP0 PB1 setting for QSPI0_MISO1        */
#define SYS_GPB_MFP0_PB1MFP_I3C0_SCL          (0x10UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for I3C0_SCL           */
#define SYS_GPB_MFP0_PB1MFP_UTCPD0_VBDCHG     (0x11UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for UTCPD0_VBDCHG      */
#define SYS_GPB_MFP0_PB1MFP_KPI_ROW2          (0x12UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for KPI_ROW2           */
#define SYS_GPB_MFP0_PB1MFP_LPIO3             (0x17UL<<SYS_GPB_MFP0_PB1MFP_Pos)   /*!< GPB_MFP0 PB1 setting for LPIO3              */

/* PB.2 MFP */
#define SYS_GPB_MFP0_PB2MFP_GPIO              (0x0UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for GPIO               */
#define SYS_GPB_MFP0_PB2MFP_ACMP0_P1          (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for ACMP0_P1           */
#define SYS_GPB_MFP0_PB2MFP_EADC0_CH2         (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EADC0_CH2          */
#define SYS_GPB_MFP0_PB2MFP_EADC1_CH10        (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EADC1_CH10         */
#define SYS_GPB_MFP0_PB2MFP_LPADC0_CH2        (0x1UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for LPADC0_CH2         */
#define SYS_GPB_MFP0_PB2MFP_EBI_ADR3          (0x2UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EBI_ADR3           */
#define SYS_GPB_MFP0_PB2MFP_SD0_DAT0          (0x3UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for SD0_DAT0           */
#define SYS_GPB_MFP0_PB2MFP_EMAC0_RMII_CRSDV  (0x4UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EMAC0_RMII_CRSDV   */
#define SYS_GPB_MFP0_PB2MFP_SPI1_SS           (0x5UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for SPI1_SS            */
#define SYS_GPB_MFP0_PB2MFP_UART1_RXD         (0x6UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for UART1_RXD          */
#define SYS_GPB_MFP0_PB2MFP_UART5_nCTS        (0x7UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for UART5_nCTS         */
#define SYS_GPB_MFP0_PB2MFP_SC0_PWR           (0x9UL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for SC0_PWR            */
#define SYS_GPB_MFP0_PB2MFP_I2S0_DO           (0xAUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for I2S0_DO            */
#define SYS_GPB_MFP0_PB2MFP_EPWM0_CH3         (0xBUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for EPWM0_CH3          */
#define SYS_GPB_MFP0_PB2MFP_I2C1_SDA          (0xCUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for I2C1_SDA           */
#define SYS_GPB_MFP0_PB2MFP_TM3               (0xEUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for TM3                */
#define SYS_GPB_MFP0_PB2MFP_INT3              (0xFUL<<SYS_GPB_MFP0_PB2MFP_Pos)    /*!< GPB_MFP0 PB2 setting for INT3               */
#define SYS_GPB_MFP0_PB2MFP_DMIC1_CLK         (0x10UL<<SYS_GPB_MFP0_PB2MFP_Pos)   /*!< GPB_MFP0 PB2 setting for DMIC1_CLK          */
#define SYS_GPB_MFP0_PB2MFP_PSIO0_CH7         (0x11UL<<SYS_GPB_MFP0_PB2MFP_Pos)   /*!< GPB_MFP0 PB2 setting for PSIO0_CH7          */
#define SYS_GPB_MFP0_PB2MFP_KPI_ROW1          (0x12UL<<SYS_GPB_MFP0_PB2MFP_Pos)   /*!< GPB_MFP0 PB2 setting for KPI_ROW1           */
#define SYS_GPB_MFP0_PB2MFP_LPIO6             (0x17UL<<SYS_GPB_MFP0_PB2MFP_Pos)   /*!< GPB_MFP0 PB2 setting for LPIO6              */

