OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PB.9 MFP */
#define SYS_GPB_MFP2_PB9MFP_GPIO              (0x0UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for GPIO               */
#define SYS_GPB_MFP2_PB9MFP_ACMP2_P2          (0x1UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for ACMP2_P2           */
#define SYS_GPB_MFP2_PB9MFP_EADC0_CH9         (0x1UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for EADC0_CH9          */
#define SYS_GPB_MFP2_PB9MFP_LPADC0_CH9        (0x1UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for LPADC0_CH9         */
#define SYS_GPB_MFP2_PB9MFP_EBI_ADR18         (0x2UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for EBI_ADR18          */
#define SYS_GPB_MFP2_PB9MFP_EMAC0_RMII_TXD0   (0x3UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for EMAC0_RMII_TXD0    */
#define SYS_GPB_MFP2_PB9MFP_UART0_TXD         (0x5UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART0_TXD          */
#define SYS_GPB_MFP2_PB9MFP_UART1_nCTS        (0x6UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART1_nCTS         */
#define SYS_GPB_MFP2_PB9MFP_I2C1_SMBAL        (0x7UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for I2C1_SMBAL         */
#define SYS_GPB_MFP2_PB9MFP_UART7_TXD         (0x8UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for UART7_TXD          */
#define SYS_GPB_MFP2_PB9MFP_I2C0_SCL          (0x9UL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for I2C0_SCL           */
#define SYS_GPB_MFP2_PB9MFP_BPWM1_CH2         (0xAUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for BPWM1_CH2          */
#define SYS_GPB_MFP2_PB9MFP_SPI3_MISO         (0xBUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for SPI3_MISO          */
#define SYS_GPB_MFP2_PB9MFP_INT7              (0xDUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for INT7               */
#define SYS_GPB_MFP2_PB9MFP_CCAP_HSYNC        (0xEUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for CCAP_HSYNC         */
#define SYS_GPB_MFP2_PB9MFP_USB_VBUS_ST       (0xFUL<<SYS_GPB_MFP2_PB9MFP_Pos)    /*!< GPB_MFP2 PB9 setting for USB_VBUS_ST        */
#define SYS_GPB_MFP2_PB9MFP_ETMC_TRACE_DATA1  (0x10UL<<SYS_GPB_MFP2_PB9MFP_Pos)   /*!< GPB_MFP2 PB9 setting for ETMC_TRACE_DATA1   */
#define SYS_GPB_MFP2_PB9MFP_LPUART0_TXD       (0x15UL<<SYS_GPB_MFP2_PB9MFP_Pos)   /*!< GPB_MFP2 PB9 setting for LPUART0_TXD        */

/* PB.10 MFP */
#define SYS_GPB_MFP2_PB10MFP_GPIO             (0x0UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for GPIO              */
#define SYS_GPB_MFP2_PB10MFP_ACMP2_P3         (0x1UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for ACMP2_P3          */
#define SYS_GPB_MFP2_PB10MFP_EADC0_CH10       (0x1UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for EADC0_CH10        */
#define SYS_GPB_MFP2_PB10MFP_LPADC0_CH10      (0x1UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for LPADC0_CH10       */
#define SYS_GPB_MFP2_PB10MFP_EBI_ADR17        (0x2UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for EBI_ADR17         */
#define SYS_GPB_MFP2_PB10MFP_EMAC0_RMII_MDIO  (0x3UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for EMAC0_RMII_MDIO   */
#define SYS_GPB_MFP2_PB10MFP_UART0_nRTS       (0x5UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for UART0_nRTS        */
#define SYS_GPB_MFP2_PB10MFP_UART4_RXD        (0x6UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for UART4_RXD         */
#define SYS_GPB_MFP2_PB10MFP_I2C1_SDA         (0x7UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for I2C1_SDA          */
#define SYS_GPB_MFP2_PB10MFP_CAN0_RXD         (0x8UL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for CAN0_RXD          */
#define SYS_GPB_MFP2_PB10MFP_BPWM1_CH1        (0xAUL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for BPWM1_CH1         */
#define SYS_GPB_MFP2_PB10MFP_SPI3_SS          (0xBUL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for SPI3_SS           */
#define SYS_GPB_MFP2_PB10MFP_CCAP_VSYNC       (0xCUL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for CCAP_VSYNC        */
#define SYS_GPB_MFP2_PB10MFP_HSUSB_VBUS_EN    (0xEUL<<SYS_GPB_MFP2_PB10MFP_Pos)   /*!< GPB_MFP2 PB10 setting for HSUSB_VBUS_EN     */
#define SYS_GPB_MFP2_PB10MFP_ETMC_TRACE_DATA0 (0x10UL<<SYS_GPB_MFP2_PB10MFP_Pos)  /*!< GPB_MFP2 PB10 setting for ETMC_TRACE_DATA0  */
#define SYS_GPB_MFP2_PB10MFP_LPUART0_nRTS     (0x15UL<<SYS_GPB_MFP2_PB10MFP_Pos)  /*!< GPB_MFP2 PB10 setting for LPUART0_nRTS      */

/* PB.11 MFP */
#define SYS_GPB_MFP2_PB11MFP_GPIO             (0x0UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for GPIO              */
#define SYS_GPB_MFP2_PB11MFP_EADC0_CH11       (0x1UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for EADC0_CH11        */
#define SYS_GPB_MFP2_PB11MFP_LPADC0_CH11      (0x1UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for LPADC0_CH11       */
#define SYS_GPB_MFP2_PB11MFP_EBI_ADR16        (0x2UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for EBI_ADR16         */
#define SYS_GPB_MFP2_PB11MFP_EMAC0_RMII_MDC   (0x3UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for EMAC0_RMII_MDC    */
#define SYS_GPB_MFP2_PB11MFP_UART0_nCTS       (0x5UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for UART0_nCTS        */
#define SYS_GPB_MFP2_PB11MFP_UART4_TXD        (0x6UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for UART4_TXD         */
#define SYS_GPB_MFP2_PB11MFP_I2C1_SCL         (0x7UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for I2C1_SCL          */
#define SYS_GPB_MFP2_PB11MFP_CAN0_TXD         (0x8UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for CAN0_TXD          */
#define SYS_GPB_MFP2_PB11MFP_SPI0_I2SMCLK     (0x9UL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for SPI0_I2SMCLK      */
#define SYS_GPB_MFP2_PB11MFP_BPWM1_CH0        (0xAUL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for BPWM1_CH0         */
#define SYS_GPB_MFP2_PB11MFP_SPI3_CLK         (0xBUL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for SPI3_CLK          */
#define SYS_GPB_MFP2_PB11MFP_CCAP_SFIELD      (0xCUL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for CCAP_SFIELD       */
#define SYS_GPB_MFP2_PB11MFP_HSUSB_VBUS_ST    (0xEUL<<SYS_GPB_MFP2_PB11MFP_Pos)   /*!< GPB_MFP2 PB11 setting for HSUSB_VBUS_ST     */
#define SYS_GPB_MFP2_PB11MFP_ETMC_TRACE_CLK   (0x10UL<<SYS_GPB_MFP2_PB11MFP_Pos)  /*!< GPB_MFP2 PB11 setting for ETMC_TRACE_CLK    */
#define SYS_GPB_MFP2_PB11MFP_LPUART0_nCTS     (0x15UL<<SYS_GPB_MFP2_PB11MFP_Pos)  /*!< GPB_MFP2 PB11 setting for LPUART0_nCTS      */

/* PB.12 MFP */
#define SYS_GPB_MFP3_PB12MFP_GPIO             (0x0UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for GPIO              */
#define SYS_GPB_MFP3_PB12MFP_ACMP0_P2         (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for ACMP0_P2          */
#define SYS_GPB_MFP3_PB12MFP_ACMP1_P2         (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for ACMP1_P2          */
#define SYS_GPB_MFP3_PB12MFP_DAC0_OUT         (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for DAC0_OUT          */
#define SYS_GPB_MFP3_PB12MFP_EADC0_CH12       (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EADC0_CH12        */
#define SYS_GPB_MFP3_PB12MFP_EADC1_CH12       (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EADC1_CH12        */
#define SYS_GPB_MFP3_PB12MFP_LPADC0_CH12      (0x1UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for LPADC0_CH12       */
#define SYS_GPB_MFP3_PB12MFP_EBI_AD15         (0x2UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EBI_AD15          */
#define SYS_GPB_MFP3_PB12MFP_SC1_CLK          (0x3UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for SC1_CLK           */
#define SYS_GPB_MFP3_PB12MFP_SPI0_MOSI        (0x4UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for SPI0_MOSI         */
#define SYS_GPB_MFP3_PB12MFP_USCI0_CLK        (0x5UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for USCI0_CLK         */
#define SYS_GPB_MFP3_PB12MFP_UART0_RXD        (0x6UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for UART0_RXD         */
#define SYS_GPB_MFP3_PB12MFP_UART3_nCTS       (0x7UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for UART3_nCTS        */
#define SYS_GPB_MFP3_PB12MFP_I2C2_SDA         (0x8UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for I2C2_SDA          */
#define SYS_GPB_MFP3_PB12MFP_SD0_nCD          (0x9UL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for SD0_nCD           */
#define SYS_GPB_MFP3_PB12MFP_CCAP_SCLK        (0xAUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for CCAP_SCLK         */
#define SYS_GPB_MFP3_PB12MFP_EPWM1_CH3        (0xBUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EPWM1_CH3         */
#define SYS_GPB_MFP3_PB12MFP_ETMC_TRACE_DATA3 (0xCUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for ETMC_TRACE_DATA3  */
#define SYS_GPB_MFP3_PB12MFP_TM3_EXT          (0xDUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for TM3_EXT           */
#define SYS_GPB_MFP3_PB12MFP_EBI_AD11         (0xEUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for EBI_AD11          */
#define SYS_GPB_MFP3_PB12MFP_SPI0_I2SMCLK     (0xFUL<<SYS_GPB_MFP3_PB12MFP_Pos)   /*!< GPB_MFP3 PB12 setting for SPI0_I2SMCLK      */
#define SYS_GPB_MFP3_PB12MFP_SWODEC_SWO       (0x10UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for SWODEC_SWO        */
#define SYS_GPB_MFP3_PB12MFP_PSIO0_CH3        (0x11UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for PSIO0_CH3         */
#define SYS_GPB_MFP3_PB12MFP_KPI_COL3         (0x12UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for KPI_COL3          */
#define SYS_GPB_MFP3_PB12MFP_QSPI0_CLK        (0x13UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for QSPI0_CLK         */
#define SYS_GPB_MFP3_PB12MFP_LPSPI0_MOSI      (0x14UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for LPSPI0_MOSI       */
#define SYS_GPB_MFP3_PB12MFP_LPUART0_RXD      (0x15UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for LPUART0_RXD       */
#define SYS_GPB_MFP3_PB12MFP_UTCPD0_VBSRCEN   (0x16UL<<SYS_GPB_MFP3_PB12MFP_Pos)  /*!< GPB_MFP3 PB12 setting for UTCPD0_VBSRCEN    */

