OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PC.2 MFP */
#define SYS_GPC_MFP0_PC2MFP_GPIO              (0x0UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for GPIO               */
#define SYS_GPC_MFP0_PC2MFP_EBI_AD2           (0x2UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for EBI_AD2            */
#define SYS_GPC_MFP0_PC2MFP_QSPI0_CLK         (0x4UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for QSPI0_CLK          */
#define SYS_GPC_MFP0_PC2MFP_SC1_RST           (0x5UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for SC1_RST            */
#define SYS_GPC_MFP0_PC2MFP_I2S0_DI           (0x6UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for I2S0_DI            */
#define SYS_GPC_MFP0_PC2MFP_SPI1_MOSI         (0x7UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for SPI1_MOSI          */
#define SYS_GPC_MFP0_PC2MFP_UART2_nCTS        (0x8UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for UART2_nCTS         */
#define SYS_GPC_MFP0_PC2MFP_I2C0_SMBSUS       (0x9UL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for I2C0_SMBSUS        */
#define SYS_GPC_MFP0_PC2MFP_CAN1_RXD          (0xAUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for CAN1_RXD           */
#define SYS_GPC_MFP0_PC2MFP_UART3_RXD         (0xBUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for UART3_RXD          */
#define SYS_GPC_MFP0_PC2MFP_EPWM1_CH3         (0xCUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for EPWM1_CH3          */
#define SYS_GPC_MFP0_PC2MFP_CCAP_DATA2        (0xDUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for CCAP_DATA2         */
#define SYS_GPC_MFP0_PC2MFP_QSPI1_MOSI0       (0xEUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for QSPI1_MOSI0        */
#define SYS_GPC_MFP0_PC2MFP_I2C3_SDA          (0xFUL<<SYS_GPC_MFP0_PC2MFP_Pos)    /*!< GPC_MFP0 PC2 setting for I2C3_SDA           */
#define SYS_GPC_MFP0_PC2MFP_SPIM0_RESETN      (0x10UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for SPIM0_RESETN       */
#define SYS_GPC_MFP0_PC2MFP_PSIO0_CH3         (0x11UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for PSIO0_CH3          */
#define SYS_GPC_MFP0_PC2MFP_KPI_ROW3          (0x12UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for KPI_ROW3           */
#define SYS_GPC_MFP0_PC2MFP_UTCPD0_CCDB1      (0x13UL<<SYS_GPC_MFP0_PC2MFP_Pos)   /*!< GPC_MFP0 PC2 setting for UTCPD0_CCDB1       */

/* PC.3 MFP */
#define SYS_GPC_MFP0_PC3MFP_GPIO              (0x0UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for GPIO               */
#define SYS_GPC_MFP0_PC3MFP_EBI_AD3           (0x2UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for EBI_AD3            */
#define SYS_GPC_MFP0_PC3MFP_QSPI0_SS          (0x4UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for QSPI0_SS           */
#define SYS_GPC_MFP0_PC3MFP_SC1_PWR           (0x5UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for SC1_PWR            */
#define SYS_GPC_MFP0_PC3MFP_I2S0_MCLK         (0x6UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for I2S0_MCLK          */
#define SYS_GPC_MFP0_PC3MFP_SPI1_MISO         (0x7UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for SPI1_MISO          */
#define SYS_GPC_MFP0_PC3MFP_UART2_nRTS        (0x8UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for UART2_nRTS         */
#define SYS_GPC_MFP0_PC3MFP_I2C0_SMBAL        (0x9UL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for I2C0_SMBAL         */
#define SYS_GPC_MFP0_PC3MFP_CAN1_TXD          (0xAUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for CAN1_TXD           */
#define SYS_GPC_MFP0_PC3MFP_UART3_TXD         (0xBUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for UART3_TXD          */
#define SYS_GPC_MFP0_PC3MFP_EPWM1_CH2         (0xCUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for EPWM1_CH2          */
#define SYS_GPC_MFP0_PC3MFP_CCAP_DATA3        (0xDUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for CCAP_DATA3         */
#define SYS_GPC_MFP0_PC3MFP_QSPI1_MISO0       (0xEUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for QSPI1_MISO0        */
#define SYS_GPC_MFP0_PC3MFP_I2C3_SCL          (0xFUL<<SYS_GPC_MFP0_PC3MFP_Pos)    /*!< GPC_MFP0 PC3 setting for I2C3_SCL           */
#define SYS_GPC_MFP0_PC3MFP_SPIM0_SS          (0x10UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for SPIM0_SS           */
#define SYS_GPC_MFP0_PC3MFP_PSIO0_CH2         (0x11UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for PSIO0_CH2          */
#define SYS_GPC_MFP0_PC3MFP_KPI_ROW2          (0x12UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for KPI_ROW2           */
#define SYS_GPC_MFP0_PC3MFP_UTCPD0_CCDB2      (0x13UL<<SYS_GPC_MFP0_PC3MFP_Pos)   /*!< GPC_MFP0 PC3 setting for UTCPD0_CCDB2       */

/* PC.4 MFP */
#define SYS_GPC_MFP1_PC4MFP_GPIO              (0x0UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for GPIO               */
#define SYS_GPC_MFP1_PC4MFP_EBI_AD4           (0x2UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for EBI_AD4            */
#define SYS_GPC_MFP1_PC4MFP_QSPI0_MOSI1       (0x4UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for QSPI0_MOSI1        */
#define SYS_GPC_MFP1_PC4MFP_SC1_nCD           (0x5UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for SC1_nCD            */
#define SYS_GPC_MFP1_PC4MFP_I2S0_BCLK         (0x6UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for I2S0_BCLK          */
#define SYS_GPC_MFP1_PC4MFP_SPI1_I2SMCLK      (0x7UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for SPI1_I2SMCLK       */
#define SYS_GPC_MFP1_PC4MFP_UART2_RXD         (0x8UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for UART2_RXD          */
#define SYS_GPC_MFP1_PC4MFP_I2C1_SDA          (0x9UL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for I2C1_SDA           */
#define SYS_GPC_MFP1_PC4MFP_CAN0_RXD          (0xAUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for CAN0_RXD           */
#define SYS_GPC_MFP1_PC4MFP_UART4_RXD         (0xBUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for UART4_RXD          */
#define SYS_GPC_MFP1_PC4MFP_EPWM1_CH1         (0xCUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for EPWM1_CH1          */
#define SYS_GPC_MFP1_PC4MFP_CCAP_DATA4        (0xDUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for CCAP_DATA4         */
#define SYS_GPC_MFP1_PC4MFP_QSPI1_CLK         (0xEUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for QSPI1_CLK          */
#define SYS_GPC_MFP1_PC4MFP_I2C3_SMBSUS       (0xFUL<<SYS_GPC_MFP1_PC4MFP_Pos)    /*!< GPC_MFP1 PC4 setting for I2C3_SMBSUS        */
#define SYS_GPC_MFP1_PC4MFP_SPIM0_CLK         (0x10UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for SPIM0_CLK          */
#define SYS_GPC_MFP1_PC4MFP_PSIO0_CH1         (0x11UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for PSIO0_CH1          */
#define SYS_GPC_MFP1_PC4MFP_KPI_ROW1          (0x12UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for KPI_ROW1           */
#define SYS_GPC_MFP1_PC4MFP_UTCPD0_FRSTX1     (0x13UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for UTCPD0_FRSTX1      */
#define SYS_GPC_MFP1_PC4MFP_UTCPD0_DISCHG     (0x14UL<<SYS_GPC_MFP1_PC4MFP_Pos)   /*!< GPC_MFP1 PC4 setting for UTCPD0_DISCHG      */

/* PC.5 MFP */
#define SYS_GPC_MFP1_PC5MFP_GPIO              (0x0UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for GPIO               */
#define SYS_GPC_MFP1_PC5MFP_EBI_AD5           (0x2UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for EBI_AD5            */
#define SYS_GPC_MFP1_PC5MFP_QSPI0_MISO1       (0x4UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for QSPI0_MISO1        */
#define SYS_GPC_MFP1_PC5MFP_UART2_TXD         (0x8UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for UART2_TXD          */
#define SYS_GPC_MFP1_PC5MFP_I2C1_SCL          (0x9UL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for I2C1_SCL           */
#define SYS_GPC_MFP1_PC5MFP_CAN0_TXD          (0xAUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for CAN0_TXD           */
#define SYS_GPC_MFP1_PC5MFP_UART4_TXD         (0xBUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for UART4_TXD          */
#define SYS_GPC_MFP1_PC5MFP_EPWM1_CH0         (0xCUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for EPWM1_CH0          */
#define SYS_GPC_MFP1_PC5MFP_CCAP_DATA5        (0xDUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for CCAP_DATA5         */
#define SYS_GPC_MFP1_PC5MFP_QSPI1_SS          (0xEUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for QSPI1_SS           */
#define SYS_GPC_MFP1_PC5MFP_I2C3_SMBAL        (0xFUL<<SYS_GPC_MFP1_PC5MFP_Pos)    /*!< GPC_MFP1 PC5 setting for I2C3_SMBAL         */
#define SYS_GPC_MFP1_PC5MFP_SPIM0_CLKN        (0x10UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for SPIM0_CLKN         */
#define SYS_GPC_MFP1_PC5MFP_PSIO0_CH0         (0x11UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for PSIO0_CH0          */
#define SYS_GPC_MFP1_PC5MFP_KPI_ROW0          (0x12UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for KPI_ROW0           */
#define SYS_GPC_MFP1_PC5MFP_UTCPD0_FRSTX2     (0x13UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for UTCPD0_FRSTX2      */
#define SYS_GPC_MFP1_PC5MFP_UTCPD0_DISCHG     (0x14UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for UTCPD0_DISCHG      */
#define SYS_GPC_MFP1_PC5MFP_I3C0_PUPEN        (0x15UL<<SYS_GPC_MFP1_PC5MFP_Pos)   /*!< GPC_MFP1 PC5 setting for I3C0_PUPEN         */

/* PC.6 MFP */
#define SYS_GPC_MFP1_PC6MFP_GPIO              (0x0UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for GPIO               */
#define SYS_GPC_MFP1_PC6MFP_EBI_AD8           (0x2UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for EBI_AD8            */
#define SYS_GPC_MFP1_PC6MFP_EMAC0_RMII_RXD1   (0x3UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for EMAC0_RMII_RXD1    */
#define SYS_GPC_MFP1_PC6MFP_SPI1_MOSI         (0x4UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for SPI1_MOSI          */
#define SYS_GPC_MFP1_PC6MFP_UART4_RXD         (0x5UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART4_RXD          */
#define SYS_GPC_MFP1_PC6MFP_SC2_RST           (0x6UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for SC2_RST            */
#define SYS_GPC_MFP1_PC6MFP_UART0_nRTS        (0x7UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART0_nRTS         */
#define SYS_GPC_MFP1_PC6MFP_I2C1_SMBSUS       (0x8UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for I2C1_SMBSUS        */
#define SYS_GPC_MFP1_PC6MFP_UART6_RXD         (0x9UL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for UART6_RXD          */
#define SYS_GPC_MFP1_PC6MFP_ACMP3_WLAT        (0xAUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for ACMP3_WLAT         */
#define SYS_GPC_MFP1_PC6MFP_EPWM1_CH3         (0xBUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for EPWM1_CH3          */
#define SYS_GPC_MFP1_PC6MFP_BPWM1_CH1         (0xCUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for BPWM1_CH1          */
#define SYS_GPC_MFP1_PC6MFP_TM1               (0xEUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for TM1                */
#define SYS_GPC_MFP1_PC6MFP_INT2              (0xFUL<<SYS_GPC_MFP1_PC6MFP_Pos)    /*!< GPC_MFP1 PC6 setting for INT2               */
#define SYS_GPC_MFP1_PC6MFP_UTCPD0_FRSTX2     (0x11UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for UTCPD0_FRSTX2      */
#define SYS_GPC_MFP1_PC6MFP_KPI_COL2          (0x12UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for KPI_COL2           */
#define SYS_GPC_MFP1_PC6MFP_UTCPD0_DISCHG     (0x13UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for UTCPD0_DISCHG      */
#define SYS_GPC_MFP1_PC6MFP_LPUART0_nRTS      (0x15UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for LPUART0_nRTS       */
#define SYS_GPC_MFP1_PC6MFP_LPTM1             (0x17UL<<SYS_GPC_MFP1_PC6MFP_Pos)   /*!< GPC_MFP1 PC6 setting for LPTM1              */

