OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PC.13 MFP */
#define SYS_GPC_MFP3_PC13MFP_GPIO             (0x0UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for GPIO              */
#define SYS_GPC_MFP3_PC13MFP_EADC0_CH19       (0x1UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EADC0_CH19        */
#define SYS_GPC_MFP3_PC13MFP_EADC1_CH3        (0x1UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EADC1_CH3         */
#define SYS_GPC_MFP3_PC13MFP_LPADC0_CH19      (0x1UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for LPADC0_CH19       */
#define SYS_GPC_MFP3_PC13MFP_EBI_ADR10        (0x2UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EBI_ADR10         */
#define SYS_GPC_MFP3_PC13MFP_SC2_nCD          (0x3UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for SC2_nCD           */
#define SYS_GPC_MFP3_PC13MFP_SPI2_I2SMCLK     (0x4UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for SPI2_I2SMCLK      */
#define SYS_GPC_MFP3_PC13MFP_CAN1_TXD         (0x5UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for CAN1_TXD          */
#define SYS_GPC_MFP3_PC13MFP_USCI0_CTL0       (0x6UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for USCI0_CTL0        */
#define SYS_GPC_MFP3_PC13MFP_UART2_TXD        (0x7UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for UART2_TXD         */
#define SYS_GPC_MFP3_PC13MFP_UART8_nCTS       (0x8UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for UART8_nCTS        */
#define SYS_GPC_MFP3_PC13MFP_BPWM0_CH4        (0x9UL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for BPWM0_CH4         */
#define SYS_GPC_MFP3_PC13MFP_CLKO             (0xDUL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for CLKO              */
#define SYS_GPC_MFP3_PC13MFP_EADC0_ST         (0xEUL<<SYS_GPC_MFP3_PC13MFP_Pos)   /*!< GPC_MFP3 PC13 setting for EADC0_ST          */
#define SYS_GPC_MFP3_PC13MFP_LPADC0_ST        (0x17UL<<SYS_GPC_MFP3_PC13MFP_Pos)  /*!< GPC_MFP3 PC13 setting for LPADC0_ST         */

/* PC.14 MFP */
#define SYS_GPC_MFP3_PC14MFP_GPIO             (0x0UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for GPIO              */
#define SYS_GPC_MFP3_PC14MFP_EBI_AD11         (0x2UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for EBI_AD11          */
#define SYS_GPC_MFP3_PC14MFP_SC1_nCD          (0x3UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for SC1_nCD           */
#define SYS_GPC_MFP3_PC14MFP_SPI0_I2SMCLK     (0x4UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for SPI0_I2SMCLK      */
#define SYS_GPC_MFP3_PC14MFP_USCI0_CTL0       (0x5UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for USCI0_CTL0        */
#define SYS_GPC_MFP3_PC14MFP_QSPI0_CLK        (0x6UL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for QSPI0_CLK         */
#define SYS_GPC_MFP3_PC14MFP_TRACE_SWO        (0xAUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for TRACE_SWO         */
#define SYS_GPC_MFP3_PC14MFP_EPWM0_SYNC_IN    (0xBUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for EPWM0_SYNC_IN     */
#define SYS_GPC_MFP3_PC14MFP_ETMC_TRACE_CLK   (0xCUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for ETMC_TRACE_CLK    */
#define SYS_GPC_MFP3_PC14MFP_TM1              (0xDUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for TM1               */
#define SYS_GPC_MFP3_PC14MFP_USB_VBUS_ST      (0xEUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for USB_VBUS_ST       */
#define SYS_GPC_MFP3_PC14MFP_HSUSB_VBUS_ST    (0xFUL<<SYS_GPC_MFP3_PC14MFP_Pos)   /*!< GPC_MFP3 PC14 setting for HSUSB_VBUS_ST     */
#define SYS_GPC_MFP3_PC14MFP_LPTM1            (0x17UL<<SYS_GPC_MFP3_PC14MFP_Pos)  /*!< GPC_MFP3 PC14 setting for LPTM1             */

/* PD.0 MFP */
#define SYS_GPD_MFP0_PD0MFP_GPIO              (0x0UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for GPIO               */
#define SYS_GPD_MFP0_PD0MFP_EBI_AD13          (0x2UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for EBI_AD13           */
#define SYS_GPD_MFP0_PD0MFP_USCI0_CLK         (0x3UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for USCI0_CLK          */
#define SYS_GPD_MFP0_PD0MFP_SPI0_MOSI         (0x4UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for SPI0_MOSI          */
#define SYS_GPD_MFP0_PD0MFP_UART3_RXD         (0x5UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for UART3_RXD          */
#define SYS_GPD_MFP0_PD0MFP_I2C2_SDA          (0x6UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for I2C2_SDA           */
#define SYS_GPD_MFP0_PD0MFP_SC2_CLK           (0x7UL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for SC2_CLK            */
#define SYS_GPD_MFP0_PD0MFP_I2S1_DO           (0xAUL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for I2S1_DO            */
#define SYS_GPD_MFP0_PD0MFP_EQEI2_A           (0xCUL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for EQEI2_A            */
#define SYS_GPD_MFP0_PD0MFP_ECAP2_IC1         (0xDUL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for ECAP2_IC1          */
#define SYS_GPD_MFP0_PD0MFP_TM2               (0xEUL<<SYS_GPD_MFP0_PD0MFP_Pos)    /*!< GPD_MFP0 PD0 setting for TM2                */
#define SYS_GPD_MFP0_PD0MFP_LPSPI0_MOSI       (0x14UL<<SYS_GPD_MFP0_PD0MFP_Pos)   /*!< GPD_MFP0 PD0 setting for LPSPI0_MOSI        */
#define SYS_GPD_MFP0_PD0MFP_LPIO6             (0x17UL<<SYS_GPD_MFP0_PD0MFP_Pos)   /*!< GPD_MFP0 PD0 setting for LPIO6              */

/* PD.1 MFP */
#define SYS_GPD_MFP0_PD1MFP_GPIO              (0x0UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for GPIO               */
#define SYS_GPD_MFP0_PD1MFP_EBI_AD12          (0x2UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for EBI_AD12           */
#define SYS_GPD_MFP0_PD1MFP_USCI0_DAT0        (0x3UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for USCI0_DAT0         */
#define SYS_GPD_MFP0_PD1MFP_SPI0_MISO         (0x4UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for SPI0_MISO          */
#define SYS_GPD_MFP0_PD1MFP_UART3_TXD         (0x5UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for UART3_TXD          */
#define SYS_GPD_MFP0_PD1MFP_I2C2_SCL          (0x6UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for I2C2_SCL           */
#define SYS_GPD_MFP0_PD1MFP_SC2_DAT           (0x7UL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for SC2_DAT            */
#define SYS_GPD_MFP0_PD1MFP_I2S1_DI           (0xAUL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for I2S1_DI            */
#define SYS_GPD_MFP0_PD1MFP_EQEI2_INDEX       (0xCUL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for EQEI2_INDEX        */
#define SYS_GPD_MFP0_PD1MFP_ECAP2_IC0         (0xDUL<<SYS_GPD_MFP0_PD1MFP_Pos)    /*!< GPD_MFP0 PD1 setting for ECAP2_IC0          */
#define SYS_GPD_MFP0_PD1MFP_LPSPI0_MISO       (0x14UL<<SYS_GPD_MFP0_PD1MFP_Pos)   /*!< GPD_MFP0 PD1 setting for LPSPI0_MISO        */
#define SYS_GPD_MFP0_PD1MFP_LPIO7             (0x17UL<<SYS_GPD_MFP0_PD1MFP_Pos)   /*!< GPD_MFP0 PD1 setting for LPIO7              */

/* PD.2 MFP */
#define SYS_GPD_MFP0_PD2MFP_GPIO              (0x0UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for GPIO               */
#define SYS_GPD_MFP0_PD2MFP_EBI_AD11          (0x2UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for EBI_AD11           */
#define SYS_GPD_MFP0_PD2MFP_USCI0_DAT1        (0x3UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for USCI0_DAT1         */
#define SYS_GPD_MFP0_PD2MFP_SPI0_CLK          (0x4UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for SPI0_CLK           */
#define SYS_GPD_MFP0_PD2MFP_UART3_nCTS        (0x5UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for UART3_nCTS         */
#define SYS_GPD_MFP0_PD2MFP_SC2_RST           (0x7UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for SC2_RST            */
#define SYS_GPD_MFP0_PD2MFP_UART0_RXD         (0x9UL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for UART0_RXD          */
#define SYS_GPD_MFP0_PD2MFP_I2S1_MCLK         (0xAUL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for I2S1_MCLK          */
#define SYS_GPD_MFP0_PD2MFP_EQEI3_B           (0xDUL<<SYS_GPD_MFP0_PD2MFP_Pos)    /*!< GPD_MFP0 PD2 setting for EQEI3_B            */
#define SYS_GPD_MFP0_PD2MFP_LPSPI0_CLK        (0x14UL<<SYS_GPD_MFP0_PD2MFP_Pos)   /*!< GPD_MFP0 PD2 setting for LPSPI0_CLK         */
#define SYS_GPD_MFP0_PD2MFP_LPUART0_RXD       (0x15UL<<SYS_GPD_MFP0_PD2MFP_Pos)   /*!< GPD_MFP0 PD2 setting for LPUART0_RXD        */

/* PD.3 MFP */
#define SYS_GPD_MFP0_PD3MFP_GPIO              (0x0UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for GPIO               */
#define SYS_GPD_MFP0_PD3MFP_EBI_AD10          (0x2UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for EBI_AD10           */
#define SYS_GPD_MFP0_PD3MFP_USCI0_CTL1        (0x3UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for USCI0_CTL1         */
#define SYS_GPD_MFP0_PD3MFP_SPI0_SS           (0x4UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for SPI0_SS            */
#define SYS_GPD_MFP0_PD3MFP_UART3_nRTS        (0x5UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for UART3_nRTS         */
#define SYS_GPD_MFP0_PD3MFP_SC2_PWR           (0x7UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for SC2_PWR            */
#define SYS_GPD_MFP0_PD3MFP_SC1_nCD           (0x8UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for SC1_nCD            */
#define SYS_GPD_MFP0_PD3MFP_UART0_TXD         (0x9UL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for UART0_TXD          */
#define SYS_GPD_MFP0_PD3MFP_I2S1_BCLK         (0xAUL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for I2S1_BCLK          */
#define SYS_GPD_MFP0_PD3MFP_EQEI3_A           (0xDUL<<SYS_GPD_MFP0_PD3MFP_Pos)    /*!< GPD_MFP0 PD3 setting for EQEI3_A            */
#define SYS_GPD_MFP0_PD3MFP_LPSPI0_SS         (0x14UL<<SYS_GPD_MFP0_PD3MFP_Pos)   /*!< GPD_MFP0 PD3 setting for LPSPI0_SS          */
#define SYS_GPD_MFP0_PD3MFP_LPUART0_TXD       (0x15UL<<SYS_GPD_MFP0_PD3MFP_Pos)   /*!< GPD_MFP0 PD3 setting for LPUART0_TXD        */

/* PD.4 MFP */
#define SYS_GPD_MFP1_PD4MFP_GPIO              (0x0UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for GPIO               */
#define SYS_GPD_MFP1_PD4MFP_USCI0_CTL0        (0x3UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for USCI0_CTL0         */
#define SYS_GPD_MFP1_PD4MFP_I2C1_SDA          (0x4UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for I2C1_SDA           */
#define SYS_GPD_MFP1_PD4MFP_SPI1_SS           (0x5UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for SPI1_SS            */
#define SYS_GPD_MFP1_PD4MFP_SC1_CLK           (0x8UL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for SC1_CLK            */
#define SYS_GPD_MFP1_PD4MFP_USB_VBUS_ST       (0xEUL<<SYS_GPD_MFP1_PD4MFP_Pos)    /*!< GPD_MFP1 PD4 setting for USB_VBUS_ST        */
#define SYS_GPD_MFP1_PD4MFP_PSIO0_CH7         (0x11UL<<SYS_GPD_MFP1_PD4MFP_Pos)   /*!< GPD_MFP1 PD4 setting for PSIO0_CH7          */

