OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PE.10 MFP */
#define SYS_GPE_MFP2_PE10MFP_GPIO             (0x0UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for GPIO              */
#define SYS_GPE_MFP2_PE10MFP_EBI_ADR12        (0x2UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EBI_ADR12         */
#define SYS_GPE_MFP2_PE10MFP_EMAC0_RMII_TXD0  (0x3UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EMAC0_RMII_TXD0   */
#define SYS_GPE_MFP2_PE10MFP_I2S0_DI          (0x4UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for I2S0_DI           */
#define SYS_GPE_MFP2_PE10MFP_SPI2_MOSI        (0x5UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for SPI2_MOSI         */
#define SYS_GPE_MFP2_PE10MFP_UART3_TXD        (0x7UL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for UART3_TXD         */
#define SYS_GPE_MFP2_PE10MFP_EPWM0_CH2        (0xAUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EPWM0_CH2         */
#define SYS_GPE_MFP2_PE10MFP_EPWM1_BRAKE0     (0xBUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EPWM1_BRAKE0      */
#define SYS_GPE_MFP2_PE10MFP_ECAP0_IC2        (0xCUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for ECAP0_IC2         */
#define SYS_GPE_MFP2_PE10MFP_EQEI2_B          (0xDUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for EQEI2_B           */
#define SYS_GPE_MFP2_PE10MFP_TRACE_DATA1      (0xEUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for TRACE_DATA1       */
#define SYS_GPE_MFP2_PE10MFP_ECAP3_IC2        (0xFUL<<SYS_GPE_MFP2_PE10MFP_Pos)   /*!< GPE_MFP2 PE10 setting for ECAP3_IC2         */
#define SYS_GPE_MFP2_PE10MFP_DMIC0_CLKLP      (0x10UL<<SYS_GPE_MFP2_PE10MFP_Pos)  /*!< GPE_MFP2 PE10 setting for DMIC0_CLKLP       */

/* PE.11 MFP */
#define SYS_GPE_MFP2_PE11MFP_GPIO             (0x0UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for GPIO              */
#define SYS_GPE_MFP2_PE11MFP_EBI_ADR13        (0x2UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EBI_ADR13         */
#define SYS_GPE_MFP2_PE11MFP_EMAC0_RMII_TXD1  (0x3UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EMAC0_RMII_TXD1   */
#define SYS_GPE_MFP2_PE11MFP_I2S0_DO          (0x4UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for I2S0_DO           */
#define SYS_GPE_MFP2_PE11MFP_SPI2_SS          (0x5UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for SPI2_SS           */
#define SYS_GPE_MFP2_PE11MFP_UART3_RXD        (0x7UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for UART3_RXD         */
#define SYS_GPE_MFP2_PE11MFP_UART1_nCTS       (0x8UL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for UART1_nCTS        */
#define SYS_GPE_MFP2_PE11MFP_EPWM0_CH3        (0xAUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EPWM0_CH3         */
#define SYS_GPE_MFP2_PE11MFP_EPWM1_BRAKE1     (0xBUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for EPWM1_BRAKE1      */
#define SYS_GPE_MFP2_PE11MFP_ECAP1_IC2        (0xDUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for ECAP1_IC2         */
#define SYS_GPE_MFP2_PE11MFP_TRACE_DATA0      (0xEUL<<SYS_GPE_MFP2_PE11MFP_Pos)   /*!< GPE_MFP2 PE11 setting for TRACE_DATA0       */
#define SYS_GPE_MFP2_PE11MFP_DMIC1_DAT        (0x10UL<<SYS_GPE_MFP2_PE11MFP_Pos)  /*!< GPE_MFP2 PE11 setting for DMIC1_DAT         */
#define SYS_GPE_MFP2_PE11MFP_KPI_COL7         (0x12UL<<SYS_GPE_MFP2_PE11MFP_Pos)  /*!< GPE_MFP2 PE11 setting for KPI_COL7          */

/* PE.12 MFP */
#define SYS_GPE_MFP3_PE12MFP_GPIO             (0x0UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for GPIO              */
#define SYS_GPE_MFP3_PE12MFP_EBI_ADR14        (0x2UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for EBI_ADR14         */
#define SYS_GPE_MFP3_PE12MFP_EMAC0_RMII_TXEN  (0x3UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for EMAC0_RMII_TXEN   */
#define SYS_GPE_MFP3_PE12MFP_I2S0_LRCK        (0x4UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for I2S0_LRCK         */
#define SYS_GPE_MFP3_PE12MFP_SPI2_I2SMCLK     (0x5UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for SPI2_I2SMCLK      */
#define SYS_GPE_MFP3_PE12MFP_UART1_nRTS       (0x8UL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for UART1_nRTS        */
#define SYS_GPE_MFP3_PE12MFP_EPWM0_CH4        (0xAUL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for EPWM0_CH4         */
#define SYS_GPE_MFP3_PE12MFP_ECAP1_IC1        (0xDUL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for ECAP1_IC1         */
#define SYS_GPE_MFP3_PE12MFP_TRACE_CLK        (0xEUL<<SYS_GPE_MFP3_PE12MFP_Pos)   /*!< GPE_MFP3 PE12 setting for TRACE_CLK         */
#define SYS_GPE_MFP3_PE12MFP_DMIC1_CLK        (0x10UL<<SYS_GPE_MFP3_PE12MFP_Pos)  /*!< GPE_MFP3 PE12 setting for DMIC1_CLK         */
#define SYS_GPE_MFP3_PE12MFP_KPI_COL6         (0x12UL<<SYS_GPE_MFP3_PE12MFP_Pos)  /*!< GPE_MFP3 PE12 setting for KPI_COL6          */

/* PE.13 MFP */
#define SYS_GPE_MFP3_PE13MFP_GPIO             (0x0UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for GPIO              */
#define SYS_GPE_MFP3_PE13MFP_EBI_ADR15        (0x2UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EBI_ADR15         */
#define SYS_GPE_MFP3_PE13MFP_EMAC0_PPS        (0x3UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EMAC0_PPS         */
#define SYS_GPE_MFP3_PE13MFP_I2C0_SCL         (0x4UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for I2C0_SCL          */
#define SYS_GPE_MFP3_PE13MFP_UART4_nRTS       (0x5UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for UART4_nRTS        */
#define SYS_GPE_MFP3_PE13MFP_UART1_TXD        (0x8UL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for UART1_TXD         */
#define SYS_GPE_MFP3_PE13MFP_EPWM0_CH5        (0xAUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EPWM0_CH5         */
#define SYS_GPE_MFP3_PE13MFP_EPWM1_CH0        (0xBUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for EPWM1_CH0         */
#define SYS_GPE_MFP3_PE13MFP_BPWM1_CH5        (0xCUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for BPWM1_CH5         */
#define SYS_GPE_MFP3_PE13MFP_ECAP1_IC0        (0xDUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for ECAP1_IC0         */
#define SYS_GPE_MFP3_PE13MFP_TRACE_SWO        (0xEUL<<SYS_GPE_MFP3_PE13MFP_Pos)   /*!< GPE_MFP3 PE13 setting for TRACE_SWO         */
#define SYS_GPE_MFP3_PE13MFP_KPI_COL5         (0x12UL<<SYS_GPE_MFP3_PE13MFP_Pos)  /*!< GPE_MFP3 PE13 setting for KPI_COL5          */
#define SYS_GPE_MFP3_PE13MFP_LPI2C0_SCL       (0x16UL<<SYS_GPE_MFP3_PE13MFP_Pos)  /*!< GPE_MFP3 PE13 setting for LPI2C0_SCL        */

/* PE.14 MFP */
#define SYS_GPE_MFP3_PE14MFP_GPIO             (0x0UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for GPIO              */
#define SYS_GPE_MFP3_PE14MFP_EBI_AD8          (0x2UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for EBI_AD8           */
#define SYS_GPE_MFP3_PE14MFP_UART2_TXD        (0x3UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART2_TXD         */
#define SYS_GPE_MFP3_PE14MFP_CAN0_TXD         (0x4UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for CAN0_TXD          */
#define SYS_GPE_MFP3_PE14MFP_SD1_nCD          (0x5UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for SD1_nCD           */
#define SYS_GPE_MFP3_PE14MFP_UART6_TXD        (0x6UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART6_TXD         */
#define SYS_GPE_MFP3_PE14MFP_UART3_TXD        (0x7UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART3_TXD         */
#define SYS_GPE_MFP3_PE14MFP_I2C1_SCL         (0x8UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for I2C1_SCL          */
#define SYS_GPE_MFP3_PE14MFP_UART4_nCTS       (0x9UL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART4_nCTS        */
#define SYS_GPE_MFP3_PE14MFP_UART8_TXD        (0xAUL<<SYS_GPE_MFP3_PE14MFP_Pos)   /*!< GPE_MFP3 PE14 setting for UART8_TXD         */
#define SYS_GPE_MFP3_PE14MFP_PSIO0_CH0        (0x11UL<<SYS_GPE_MFP3_PE14MFP_Pos)  /*!< GPE_MFP3 PE14 setting for PSIO0_CH0         */

