OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PE.15 MFP */
#define SYS_GPE_MFP3_PE15MFP_GPIO             (0x0UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for GPIO              */
#define SYS_GPE_MFP3_PE15MFP_EBI_AD9          (0x2UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for EBI_AD9           */
#define SYS_GPE_MFP3_PE15MFP_UART2_RXD        (0x3UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART2_RXD         */
#define SYS_GPE_MFP3_PE15MFP_CAN0_RXD         (0x4UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for CAN0_RXD          */
#define SYS_GPE_MFP3_PE15MFP_UART6_RXD        (0x6UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART6_RXD         */
#define SYS_GPE_MFP3_PE15MFP_UART3_RXD        (0x7UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART3_RXD         */
#define SYS_GPE_MFP3_PE15MFP_I2C1_SDA         (0x8UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for I2C1_SDA          */
#define SYS_GPE_MFP3_PE15MFP_UART4_nRTS       (0x9UL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART4_nRTS        */
#define SYS_GPE_MFP3_PE15MFP_UART8_RXD        (0xAUL<<SYS_GPE_MFP3_PE15MFP_Pos)   /*!< GPE_MFP3 PE15 setting for UART8_RXD         */
#define SYS_GPE_MFP3_PE15MFP_PSIO0_CH1        (0x11UL<<SYS_GPE_MFP3_PE15MFP_Pos)  /*!< GPE_MFP3 PE15 setting for PSIO0_CH1         */

/* PF.0 MFP */
#define SYS_GPF_MFP0_PF0MFP_GPIO              (0x0UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for GPIO               */
#define SYS_GPF_MFP0_PF0MFP_UART1_TXD         (0x2UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for UART1_TXD          */
#define SYS_GPF_MFP0_PF0MFP_I2C1_SCL          (0x3UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for I2C1_SCL           */
#define SYS_GPF_MFP0_PF0MFP_UART0_TXD         (0x4UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for UART0_TXD          */
#define SYS_GPF_MFP0_PF0MFP_SC1_DAT           (0x5UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for SC1_DAT            */
#define SYS_GPF_MFP0_PF0MFP_I2S0_DO           (0x6UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for I2S0_DO            */
#define SYS_GPF_MFP0_PF0MFP_USCI0_CTL1        (0x7UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for USCI0_CTL1         */
#define SYS_GPF_MFP0_PF0MFP_UART2_TXD         (0x8UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for UART2_TXD          */
#define SYS_GPF_MFP0_PF0MFP_I2C0_SCL          (0x9UL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for I2C0_SCL           */
#define SYS_GPF_MFP0_PF0MFP_EPWM1_CH4         (0xBUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for EPWM1_CH4          */
#define SYS_GPF_MFP0_PF0MFP_BPWM1_CH0         (0xCUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for BPWM1_CH0          */
#define SYS_GPF_MFP0_PF0MFP_ACMP0_O           (0xDUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for ACMP0_O            */
#define SYS_GPF_MFP0_PF0MFP_ICE_DAT           (0xEUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for ICE_DAT            */
#define SYS_GPF_MFP0_PF0MFP_EADC0_ST          (0xFUL<<SYS_GPF_MFP0_PF0MFP_Pos)    /*!< GPF_MFP0 PF0 setting for EADC0_ST           */
#define SYS_GPF_MFP0_PF0MFP_I3C0_SCL          (0x10UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for I3C0_SCL           */
#define SYS_GPF_MFP0_PF0MFP_UTCPD0_FRSTX2     (0x12UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for UTCPD0_FRSTX2      */
#define SYS_GPF_MFP0_PF0MFP_UTCPD0_DISCHG     (0x13UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for UTCPD0_DISCHG      */
#define SYS_GPF_MFP0_PF0MFP_LPUART0_TXD       (0x15UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for LPUART0_TXD        */
#define SYS_GPF_MFP0_PF0MFP_LPADC0_ST         (0x16UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for LPADC0_ST          */
#define SYS_GPF_MFP0_PF0MFP_LPIO2             (0x17UL<<SYS_GPF_MFP0_PF0MFP_Pos)   /*!< GPF_MFP0 PF0 setting for LPIO2              */

/* PF.1 MFP */
#define SYS_GPF_MFP0_PF1MFP_GPIO              (0x0UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for GPIO               */
#define SYS_GPF_MFP0_PF1MFP_UART1_RXD         (0x2UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for UART1_RXD          */
#define SYS_GPF_MFP0_PF1MFP_I2C1_SDA          (0x3UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for I2C1_SDA           */
#define SYS_GPF_MFP0_PF1MFP_UART0_RXD         (0x4UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for UART0_RXD          */
#define SYS_GPF_MFP0_PF1MFP_SC1_CLK           (0x5UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for SC1_CLK            */
#define SYS_GPF_MFP0_PF1MFP_I2S0_LRCK         (0x6UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for I2S0_LRCK          */
#define SYS_GPF_MFP0_PF1MFP_USCI0_DAT1        (0x7UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for USCI0_DAT1         */
#define SYS_GPF_MFP0_PF1MFP_UART2_RXD         (0x8UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for UART2_RXD          */
#define SYS_GPF_MFP0_PF1MFP_I2C0_SDA          (0x9UL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for I2C0_SDA           */
#define SYS_GPF_MFP0_PF1MFP_EPWM1_CH5         (0xBUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for EPWM1_CH5          */
#define SYS_GPF_MFP0_PF1MFP_BPWM1_CH1         (0xCUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for BPWM1_CH1          */
#define SYS_GPF_MFP0_PF1MFP_ACMP1_O           (0xDUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for ACMP1_O            */
#define SYS_GPF_MFP0_PF1MFP_ICE_CLK           (0xEUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for ICE_CLK            */
#define SYS_GPF_MFP0_PF1MFP_EADC1_ST          (0xFUL<<SYS_GPF_MFP0_PF1MFP_Pos)    /*!< GPF_MFP0 PF1 setting for EADC1_ST           */
#define SYS_GPF_MFP0_PF1MFP_I3C0_SDA          (0x10UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for I3C0_SDA           */
#define SYS_GPF_MFP0_PF1MFP_UTCPD0_FRSTX1     (0x12UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for UTCPD0_FRSTX1      */
#define SYS_GPF_MFP0_PF1MFP_UTCPD0_DISCHG     (0x13UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for UTCPD0_DISCHG      */
#define SYS_GPF_MFP0_PF1MFP_LPUART0_RXD       (0x15UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for LPUART0_RXD        */
#define SYS_GPF_MFP0_PF1MFP_LPIO3             (0x17UL<<SYS_GPF_MFP0_PF1MFP_Pos)   /*!< GPF_MFP0 PF1 setting for LPIO3              */

