OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PG.3 MFP */
#define SYS_GPG_MFP0_PG3MFP_GPIO              (0x0UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for GPIO               */
#define SYS_GPG_MFP0_PG3MFP_EBI_ADR12         (0x2UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for EBI_ADR12          */
#define SYS_GPG_MFP0_PG3MFP_SPI2_CLK          (0x3UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for SPI2_CLK           */
#define SYS_GPG_MFP0_PG3MFP_I2C0_SMBSUS       (0x4UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C0_SMBSUS        */
#define SYS_GPG_MFP0_PG3MFP_I2C1_SDA          (0x5UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C1_SDA           */
#define SYS_GPG_MFP0_PG3MFP_CCAP_DATA6        (0x7UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for CCAP_DATA6         */
#define SYS_GPG_MFP0_PG3MFP_I2C3_SMBSUS       (0x9UL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for I2C3_SMBSUS        */
#define SYS_GPG_MFP0_PG3MFP_UART4_RXD         (0xAUL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for UART4_RXD          */
#define SYS_GPG_MFP0_PG3MFP_UART0_RXD         (0xBUL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for UART0_RXD          */
#define SYS_GPG_MFP0_PG3MFP_TM1               (0xDUL<<SYS_GPG_MFP0_PG3MFP_Pos)    /*!< GPG_MFP0 PG3 setting for TM1                */
#define SYS_GPG_MFP0_PG3MFP_LPTM1             (0x17UL<<SYS_GPG_MFP0_PG3MFP_Pos)   /*!< GPG_MFP0 PG3 setting for LPTM1              */

/* PG.4 MFP */
#define SYS_GPG_MFP1_PG4MFP_GPIO              (0x0UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for GPIO               */
#define SYS_GPG_MFP1_PG4MFP_EBI_ADR13         (0x2UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for EBI_ADR13          */
#define SYS_GPG_MFP1_PG4MFP_SPI2_MISO         (0x3UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for SPI2_MISO          */
#define SYS_GPG_MFP1_PG4MFP_CCAP_DATA5        (0x7UL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for CCAP_DATA5         */
#define SYS_GPG_MFP1_PG4MFP_TM2               (0xDUL<<SYS_GPG_MFP1_PG4MFP_Pos)    /*!< GPG_MFP1 PG4 setting for TM2                */

/* PG.5 MFP */
#define SYS_GPG_MFP1_PG5MFP_GPIO              (0x0UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for GPIO               */
#define SYS_GPG_MFP1_PG5MFP_EBI_nCS1          (0x2UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for EBI_nCS1           */
#define SYS_GPG_MFP1_PG5MFP_SPI3_SS           (0x3UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for SPI3_SS            */
#define SYS_GPG_MFP1_PG5MFP_SC1_PWR           (0x4UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for SC1_PWR            */
#define SYS_GPG_MFP1_PG5MFP_EBI_nWRL          (0x5UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for EBI_nWRL           */
#define SYS_GPG_MFP1_PG5MFP_I2C3_SMBAL        (0x8UL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for I2C3_SMBAL         */
#define SYS_GPG_MFP1_PG5MFP_I2S1_MCLK         (0xAUL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for I2S1_MCLK          */
#define SYS_GPG_MFP1_PG5MFP_EPWM0_CH3         (0xBUL<<SYS_GPG_MFP1_PG5MFP_Pos)    /*!< GPG_MFP1 PG5 setting for EPWM0_CH3          */

/* PG.6 MFP */
#define SYS_GPG_MFP1_PG6MFP_GPIO              (0x0UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for GPIO               */
#define SYS_GPG_MFP1_PG6MFP_EBI_nCS2          (0x2UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for EBI_nCS2           */
#define SYS_GPG_MFP1_PG6MFP_SPI3_CLK          (0x3UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for SPI3_CLK           */
#define SYS_GPG_MFP1_PG6MFP_SC1_RST           (0x4UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for SC1_RST            */
#define SYS_GPG_MFP1_PG6MFP_EBI_nWRH          (0x5UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for EBI_nWRH           */
#define SYS_GPG_MFP1_PG6MFP_I2C3_SMBSUS       (0x8UL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for I2C3_SMBSUS        */
#define SYS_GPG_MFP1_PG6MFP_I2S1_DI           (0xAUL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for I2S1_DI            */
#define SYS_GPG_MFP1_PG6MFP_EPWM0_CH2         (0xBUL<<SYS_GPG_MFP1_PG6MFP_Pos)    /*!< GPG_MFP1 PG6 setting for EPWM0_CH2          */

/* PG.7 MFP */
#define SYS_GPG_MFP1_PG7MFP_GPIO              (0x0UL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for GPIO               */
#define SYS_GPG_MFP1_PG7MFP_EBI_nWRL          (0x2UL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for EBI_nWRL           */
#define SYS_GPG_MFP1_PG7MFP_SPI3_MISO         (0x3UL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for SPI3_MISO          */
#define SYS_GPG_MFP1_PG7MFP_SC1_DAT           (0x4UL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for SC1_DAT            */
#define SYS_GPG_MFP1_PG7MFP_I2C3_SCL          (0x8UL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for I2C3_SCL           */
#define SYS_GPG_MFP1_PG7MFP_I2S1_DO           (0xAUL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for I2S1_DO            */
#define SYS_GPG_MFP1_PG7MFP_EPWM0_CH1         (0xBUL<<SYS_GPG_MFP1_PG7MFP_Pos)    /*!< GPG_MFP1 PG7 setting for EPWM0_CH1          */

/* PG.8 MFP */
#define SYS_GPG_MFP2_PG8MFP_GPIO              (0x0UL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for GPIO               */
#define SYS_GPG_MFP2_PG8MFP_EBI_nWRH          (0x2UL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for EBI_nWRH           */
#define SYS_GPG_MFP2_PG8MFP_SPI3_MOSI         (0x3UL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for SPI3_MOSI          */
#define SYS_GPG_MFP2_PG8MFP_SC1_CLK           (0x4UL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for SC1_CLK            */
#define SYS_GPG_MFP2_PG8MFP_I2C3_SDA          (0x8UL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for I2C3_SDA           */
#define SYS_GPG_MFP2_PG8MFP_I2S1_LRCK         (0xAUL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for I2S1_LRCK          */
#define SYS_GPG_MFP2_PG8MFP_EPWM0_CH0         (0xBUL<<SYS_GPG_MFP2_PG8MFP_Pos)    /*!< GPG_MFP2 PG8 setting for EPWM0_CH0          */

