OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
/* PG.9 MFP */
#define SYS_GPG_MFP2_PG9MFP_GPIO              (0x0UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for GPIO               */
#define SYS_GPG_MFP2_PG9MFP_EBI_AD0           (0x2UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for EBI_AD0            */
#define SYS_GPG_MFP2_PG9MFP_SD1_DAT3          (0x3UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for SD1_DAT3           */
#define SYS_GPG_MFP2_PG9MFP_QSPI1_MISO1       (0x5UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for QSPI1_MISO1        */
#define SYS_GPG_MFP2_PG9MFP_CCAP_PIXCLK       (0x7UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for CCAP_PIXCLK        */
#define SYS_GPG_MFP2_PG9MFP_ECAP2_IC0         (0x9UL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for ECAP2_IC0          */
#define SYS_GPG_MFP2_PG9MFP_BPWM0_CH5         (0xCUL<<SYS_GPG_MFP2_PG9MFP_Pos)    /*!< GPG_MFP2 PG9 setting for BPWM0_CH5          */
#define SYS_GPG_MFP2_PG9MFP_SPIM0_D4          (0x10UL<<SYS_GPG_MFP2_PG9MFP_Pos)   /*!< GPG_MFP2 PG9 setting for SPIM0_D4           */

/* PG.10 MFP */
#define SYS_GPG_MFP2_PG10MFP_GPIO             (0x0UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for GPIO              */
#define SYS_GPG_MFP2_PG10MFP_EBI_AD1          (0x2UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for EBI_AD1           */
#define SYS_GPG_MFP2_PG10MFP_SD1_DAT2         (0x3UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for SD1_DAT2          */
#define SYS_GPG_MFP2_PG10MFP_QSPI1_MOSI1      (0x5UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for QSPI1_MOSI1       */
#define SYS_GPG_MFP2_PG10MFP_CCAP_SCLK        (0x7UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for CCAP_SCLK         */
#define SYS_GPG_MFP2_PG10MFP_ECAP2_IC1        (0x9UL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for ECAP2_IC1         */
#define SYS_GPG_MFP2_PG10MFP_BPWM0_CH4        (0xCUL<<SYS_GPG_MFP2_PG10MFP_Pos)   /*!< GPG_MFP2 PG10 setting for BPWM0_CH4         */
#define SYS_GPG_MFP2_PG10MFP_SPIM0_D3         (0x10UL<<SYS_GPG_MFP2_PG10MFP_Pos)  /*!< GPG_MFP2 PG10 setting for SPIM0_D3          */

/* PG.11 MFP */
#define SYS_GPG_MFP2_PG11MFP_GPIO             (0x0UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for GPIO              */
#define SYS_GPG_MFP2_PG11MFP_EBI_AD2          (0x2UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for EBI_AD2           */
#define SYS_GPG_MFP2_PG11MFP_SD1_DAT1         (0x3UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for SD1_DAT1          */
#define SYS_GPG_MFP2_PG11MFP_QSPI1_SS         (0x5UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for QSPI1_SS          */
#define SYS_GPG_MFP2_PG11MFP_UART7_TXD        (0x6UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for UART7_TXD         */
#define SYS_GPG_MFP2_PG11MFP_CCAP_SFIELD      (0x7UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for CCAP_SFIELD       */
#define SYS_GPG_MFP2_PG11MFP_ECAP2_IC2        (0x9UL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for ECAP2_IC2         */
#define SYS_GPG_MFP2_PG11MFP_BPWM0_CH3        (0xCUL<<SYS_GPG_MFP2_PG11MFP_Pos)   /*!< GPG_MFP2 PG11 setting for BPWM0_CH3         */
#define SYS_GPG_MFP2_PG11MFP_SPIM0_MOSI       (0x10UL<<SYS_GPG_MFP2_PG11MFP_Pos)  /*!< GPG_MFP2 PG11 setting for SPIM0_MOSI        */

/* PG.12 MFP */
#define SYS_GPG_MFP3_PG12MFP_GPIO             (0x0UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for GPIO              */
#define SYS_GPG_MFP3_PG12MFP_EBI_AD3          (0x2UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for EBI_AD3           */
#define SYS_GPG_MFP3_PG12MFP_SD1_DAT0         (0x3UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for SD1_DAT0          */
#define SYS_GPG_MFP3_PG12MFP_QSPI1_CLK        (0x5UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for QSPI1_CLK         */
#define SYS_GPG_MFP3_PG12MFP_UART7_RXD        (0x6UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for UART7_RXD         */
#define SYS_GPG_MFP3_PG12MFP_CCAP_VSYNC       (0x7UL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for CCAP_VSYNC        */
#define SYS_GPG_MFP3_PG12MFP_BPWM0_CH2        (0xCUL<<SYS_GPG_MFP3_PG12MFP_Pos)   /*!< GPG_MFP3 PG12 setting for BPWM0_CH2         */
#define SYS_GPG_MFP3_PG12MFP_SPIM0_MISO       (0x10UL<<SYS_GPG_MFP3_PG12MFP_Pos)  /*!< GPG_MFP3 PG12 setting for SPIM0_MISO        */

/* PG.13 MFP */
#define SYS_GPG_MFP3_PG13MFP_GPIO             (0x0UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for GPIO              */
#define SYS_GPG_MFP3_PG13MFP_EBI_AD4          (0x2UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for EBI_AD4           */
#define SYS_GPG_MFP3_PG13MFP_SD1_CMD          (0x3UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for SD1_CMD           */
#define SYS_GPG_MFP3_PG13MFP_QSPI1_MISO0      (0x5UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for QSPI1_MISO0       */
#define SYS_GPG_MFP3_PG13MFP_UART6_TXD        (0x6UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for UART6_TXD         */
#define SYS_GPG_MFP3_PG13MFP_CCAP_HSYNC       (0x7UL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for CCAP_HSYNC        */
#define SYS_GPG_MFP3_PG13MFP_BPWM0_CH1        (0xCUL<<SYS_GPG_MFP3_PG13MFP_Pos)   /*!< GPG_MFP3 PG13 setting for BPWM0_CH1         */
#define SYS_GPG_MFP3_PG13MFP_SPIM0_D5         (0x10UL<<SYS_GPG_MFP3_PG13MFP_Pos)  /*!< GPG_MFP3 PG13 setting for SPIM0_D5          */

/* PG.14 MFP */
#define SYS_GPG_MFP3_PG14MFP_GPIO             (0x0UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for GPIO              */
#define SYS_GPG_MFP3_PG14MFP_EBI_AD5          (0x2UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for EBI_AD5           */
#define SYS_GPG_MFP3_PG14MFP_SD1_CLK          (0x3UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for SD1_CLK           */
#define SYS_GPG_MFP3_PG14MFP_QSPI1_MOSI0      (0x5UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for QSPI1_MOSI0       */
#define SYS_GPG_MFP3_PG14MFP_UART6_RXD        (0x6UL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for UART6_RXD         */
#define SYS_GPG_MFP3_PG14MFP_BPWM0_CH0        (0xCUL<<SYS_GPG_MFP3_PG14MFP_Pos)   /*!< GPG_MFP3 PG14 setting for BPWM0_CH0         */
#define SYS_GPG_MFP3_PG14MFP_SPIM0_D6         (0x10UL<<SYS_GPG_MFP3_PG14MFP_Pos)  /*!< GPG_MFP3 PG14 setting for SPIM0_D6          */

/* PG.15 MFP */
#define SYS_GPG_MFP3_PG15MFP_GPIO             (0x0UL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for GPIO              */
#define SYS_GPG_MFP3_PG15MFP_EBI_AD15         (0x2UL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for EBI_AD15          */
#define SYS_GPG_MFP3_PG15MFP_SD1_nCD          (0x3UL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for SD1_nCD           */
#define SYS_GPG_MFP3_PG15MFP_EBI_nCS0         (0x4UL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for EBI_nCS0          */
#define SYS_GPG_MFP3_PG15MFP_CLKO             (0xEUL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for CLKO              */
#define SYS_GPG_MFP3_PG15MFP_EADC0_ST         (0xFUL<<SYS_GPG_MFP3_PG15MFP_Pos)   /*!< GPG_MFP3 PG15 setting for EADC0_ST          */
#define SYS_GPG_MFP3_PG15MFP_SPIM0_D7         (0x10UL<<SYS_GPG_MFP3_PG15MFP_Pos)  /*!< GPG_MFP3 PG15 setting for SPIM0_D7          */
#define SYS_GPG_MFP3_PG15MFP_LPADC0_ST        (0x17UL<<SYS_GPG_MFP3_PG15MFP_Pos)  /*!< GPG_MFP3 PG15 setting for LPADC0_ST         */

/* PH.0 MFP */
#define SYS_GPH_MFP0_PH0MFP_GPIO              (0x0UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for GPIO               */
#define SYS_GPH_MFP0_PH0MFP_EBI_ADR7          (0x2UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for EBI_ADR7           */
#define SYS_GPH_MFP0_PH0MFP_SPI3_MISO         (0x3UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for SPI3_MISO          */
#define SYS_GPH_MFP0_PH0MFP_UART5_TXD         (0x4UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for UART5_TXD          */
#define SYS_GPH_MFP0_PH0MFP_SC1_DAT           (0x5UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for SC1_DAT            */
#define SYS_GPH_MFP0_PH0MFP_I2C3_SCL          (0x8UL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for I2C3_SCL           */
#define SYS_GPH_MFP0_PH0MFP_TM0_EXT           (0xDUL<<SYS_GPH_MFP0_PH0MFP_Pos)    /*!< GPH_MFP0 PH0 setting for TM0_EXT            */

