OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_ACMP0_N_PB3()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_ACMP0_N)                       /*!< Set PB3 function to ACMP0_N             */
#define SET_ACMP0_O_PB7()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_ACMP0_O)                       /*!< Set PB7 function to ACMP0_O             */
#define SET_ACMP0_O_PC1()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_ACMP0_O)                       /*!< Set PC1 function to ACMP0_O             */
#define SET_ACMP0_O_PC12()          SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_ACMP0_O)                     /*!< Set PC12 function to ACMP0_O            */
#define SET_ACMP0_O_PD6()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_ACMP0_O)                       /*!< Set PD6 function to ACMP0_O             */
#define SET_ACMP0_O_PF0()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_ACMP0_O)                       /*!< Set PF0 function to ACMP0_O             */
#define SET_ACMP0_P0_PA11()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_ACMP0_P0)                    /*!< Set PA11 function to ACMP0_P0           */
#define SET_ACMP0_P1_PB2()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_ACMP0_P1)                      /*!< Set PB2 function to ACMP0_P1            */
#define SET_ACMP0_P2_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_ACMP0_P2)                    /*!< Set PB12 function to ACMP0_P2           */
#define SET_ACMP0_P3_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_ACMP0_P3)                    /*!< Set PB13 function to ACMP0_P3           */
#define SET_ACMP0_WLAT_PA7()        SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_ACMP0_WLAT)                    /*!< Set PA7 function to ACMP0_WLAT          */
#define SET_ACMP1_N_PB5()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_ACMP1_N)                       /*!< Set PB5 function to ACMP1_N             */
#define SET_ACMP1_O_PB6()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_ACMP1_O)                       /*!< Set PB6 function to ACMP1_O             */
#define SET_ACMP1_O_PC0()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_ACMP1_O)                       /*!< Set PC0 function to ACMP1_O             */
#define SET_ACMP1_O_PC11()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_ACMP1_O)                     /*!< Set PC11 function to ACMP1_O            */
#define SET_ACMP1_O_PD5()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_ACMP1_O)                       /*!< Set PD5 function to ACMP1_O             */
#define SET_ACMP1_O_PF1()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_ACMP1_O)                       /*!< Set PF1 function to ACMP1_O             */
#define SET_ACMP1_P0_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_ACMP1_P0)                    /*!< Set PA10 function to ACMP1_P0           */
#define SET_ACMP1_P1_PB4()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_ACMP1_P1)                      /*!< Set PB4 function to ACMP1_P1            */
#define SET_ACMP1_P2_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_ACMP1_P2)                    /*!< Set PB12 function to ACMP1_P2           */
#define SET_ACMP1_P3_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_ACMP1_P3)                    /*!< Set PB13 function to ACMP1_P3           */
#define SET_ACMP1_WLAT_PA6()        SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_ACMP1_WLAT)                    /*!< Set PA6 function to ACMP1_WLAT          */
#define SET_ACMP2_N_PB6()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_ACMP2_N)                       /*!< Set PB6 function to ACMP2_N             */
#define SET_ACMP2_O_PB1()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_ACMP2_O)                       /*!< Set PB1 function to ACMP2_O             */
#define SET_ACMP2_O_PE7()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_ACMP2_O)                       /*!< Set PE7 function to ACMP2_O             */
#define SET_ACMP2_O_PF3()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_ACMP2_O)                       /*!< Set PF3 function to ACMP2_O             */
#define SET_ACMP2_P0_PB7()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_ACMP2_P0)                      /*!< Set PB7 function to ACMP2_P0            */
#define SET_ACMP2_P1_PB8()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_ACMP2_P1)                      /*!< Set PB8 function to ACMP2_P1            */
#define SET_ACMP2_P2_PB9()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_ACMP2_P2)                      /*!< Set PB9 function to ACMP2_P2            */
#define SET_ACMP2_P3_PB10()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_ACMP2_P3)                    /*!< Set PB10 function to ACMP2_P3           */
#define SET_ACMP2_WLAT_PC7()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_ACMP2_WLAT)                    /*!< Set PC7 function to ACMP2_WLAT          */
#define SET_ACMP3_N_PB0()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_ACMP3_N)                       /*!< Set PB0 function to ACMP3_N             */
#define SET_ACMP3_O_PB0()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_ACMP3_O)                       /*!< Set PB0 function to ACMP3_O             */
#define SET_ACMP3_O_PE6()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_ACMP3_O)                       /*!< Set PE6 function to ACMP3_O             */
#define SET_ACMP3_O_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_ACMP3_O)                       /*!< Set PF2 function to ACMP3_O             */
#define SET_ACMP3_P0_PB1()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_ACMP3_P0)                      /*!< Set PB1 function to ACMP3_P0            */
#define SET_ACMP3_P1_PC9()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_ACMP3_P1)                      /*!< Set PC9 function to ACMP3_P1            */
#define SET_ACMP3_P2_PC10()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_ACMP3_P2)                    /*!< Set PC10 function to ACMP3_P2           */
#define SET_ACMP3_P3_PC11()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_ACMP3_P3)                    /*!< Set PC11 function to ACMP3_P3           */
#define SET_ACMP3_WLAT_PC6()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_ACMP3_WLAT)                    /*!< Set PC6 function to ACMP3_WLAT          */
#define SET_BPWM0_CH0_PA0()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_BPWM0_CH0)                     /*!< Set PA0 function to BPWM0_CH0           */
#define SET_BPWM0_CH0_PA11()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_BPWM0_CH0)                   /*!< Set PA11 function to BPWM0_CH0          */
#define SET_BPWM0_CH0_PD13()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_BPWM0_CH0)                   /*!< Set PD13 function to BPWM0_CH0          */
#define SET_BPWM0_CH0_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_BPWM0_CH0)                     /*!< Set PE2 function to BPWM0_CH0           */
#define SET_BPWM0_CH0_PG14()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_BPWM0_CH0)                   /*!< Set PG14 function to BPWM0_CH0          */
#define SET_BPWM0_CH0_PJ13()        SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ13MFP_Msk)) | SYS_GPJ_MFP3_PJ13MFP_BPWM0_CH0)                   /*!< Set PJ13 function to BPWM0_CH0          */
#define SET_BPWM0_CH1_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_BPWM0_CH1)                     /*!< Set PA1 function to BPWM0_CH1           */
#define SET_BPWM0_CH1_PA10()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_BPWM0_CH1)                   /*!< Set PA10 function to BPWM0_CH1          */
#define SET_BPWM0_CH1_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_BPWM0_CH1)                     /*!< Set PE3 function to BPWM0_CH1           */
#define SET_BPWM0_CH1_PG13()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_BPWM0_CH1)                   /*!< Set PG13 function to BPWM0_CH1          */
#define SET_BPWM0_CH1_PJ12()        SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_BPWM0_CH1)                   /*!< Set PJ12 function to BPWM0_CH1          */
#define SET_BPWM0_CH2_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_BPWM0_CH2)                     /*!< Set PA2 function to BPWM0_CH2           */
#define SET_BPWM0_CH2_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_BPWM0_CH2)                     /*!< Set PA9 function to BPWM0_CH2           */
#define SET_BPWM0_CH2_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_BPWM0_CH2)                     /*!< Set PE4 function to BPWM0_CH2           */
#define SET_BPWM0_CH2_PG12()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_BPWM0_CH2)                   /*!< Set PG12 function to BPWM0_CH2          */
#define SET_BPWM0_CH2_PJ11()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_BPWM0_CH2)                   /*!< Set PJ11 function to BPWM0_CH2          */
#define SET_BPWM0_CH3_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_BPWM0_CH3)                     /*!< Set PA3 function to BPWM0_CH3           */
#define SET_BPWM0_CH3_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_BPWM0_CH3)                     /*!< Set PA8 function to BPWM0_CH3           */
#define SET_BPWM0_CH3_PE5()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_BPWM0_CH3)                     /*!< Set PE5 function to BPWM0_CH3           */
#define SET_BPWM0_CH3_PG11()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_BPWM0_CH3)                   /*!< Set PG11 function to BPWM0_CH3          */
#define SET_BPWM0_CH3_PJ10()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_BPWM0_CH3)                   /*!< Set PJ10 function to BPWM0_CH3          */
#define SET_BPWM0_CH4_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_BPWM0_CH4)                     /*!< Set PA4 function to BPWM0_CH4           */
#define SET_BPWM0_CH4_PC13()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_BPWM0_CH4)                   /*!< Set PC13 function to BPWM0_CH4          */
#define SET_BPWM0_CH4_PE6()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_BPWM0_CH4)                     /*!< Set PE6 function to BPWM0_CH4           */
#define SET_BPWM0_CH4_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_BPWM0_CH4)                     /*!< Set PF5 function to BPWM0_CH4           */
#define SET_BPWM0_CH4_PG10()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_BPWM0_CH4)                   /*!< Set PG10 function to BPWM0_CH4          */
#define SET_BPWM0_CH4_PJ9()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ9MFP_Msk)) | SYS_GPJ_MFP2_PJ9MFP_BPWM0_CH4)                     /*!< Set PJ9 function to BPWM0_CH4           */
#define SET_BPWM0_CH5_PA5()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_BPWM0_CH5)                     /*!< Set PA5 function to BPWM0_CH5           */
#define SET_BPWM0_CH5_PD12()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_BPWM0_CH5)                   /*!< Set PD12 function to BPWM0_CH5          */
#define SET_BPWM0_CH5_PE7()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_BPWM0_CH5)                     /*!< Set PE7 function to BPWM0_CH5           */
#define SET_BPWM0_CH5_PF4()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_BPWM0_CH5)                     /*!< Set PF4 function to BPWM0_CH5           */
#define SET_BPWM0_CH5_PG9()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_BPWM0_CH5)                     /*!< Set PG9 function to BPWM0_CH5           */
#define SET_BPWM0_CH5_PJ8()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ8MFP_Msk)) | SYS_GPJ_MFP2_PJ8MFP_BPWM0_CH5)                     /*!< Set PJ8 function to BPWM0_CH5           */
#define SET_BPWM1_CH0_PB11()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_BPWM1_CH0)                   /*!< Set PB11 function to BPWM1_CH0          */
#define SET_BPWM1_CH0_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_BPWM1_CH0)                     /*!< Set PC7 function to BPWM1_CH0           */
#define SET_BPWM1_CH0_PF0()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_BPWM1_CH0)                     /*!< Set PF0 function to BPWM1_CH0           */
#define SET_BPWM1_CH0_PF3()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_BPWM1_CH0)                     /*!< Set PF3 function to BPWM1_CH0           */
#define SET_BPWM1_CH1_PB10()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_BPWM1_CH1)                   /*!< Set PB10 function to BPWM1_CH1          */
#define SET_BPWM1_CH1_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_BPWM1_CH1)                     /*!< Set PC6 function to BPWM1_CH1           */
#define SET_BPWM1_CH1_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_BPWM1_CH1)                     /*!< Set PF1 function to BPWM1_CH1           */
#define SET_BPWM1_CH1_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_BPWM1_CH1)                     /*!< Set PF2 function to BPWM1_CH1           */
#define SET_BPWM1_CH2_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_BPWM1_CH2)                   /*!< Set PA12 function to BPWM1_CH2          */
#define SET_BPWM1_CH2_PA7()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_BPWM1_CH2)                     /*!< Set PA7 function to BPWM1_CH2           */
#define SET_BPWM1_CH2_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_BPWM1_CH2)                     /*!< Set PB9 function to BPWM1_CH2           */
#define SET_BPWM1_CH3_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_BPWM1_CH3)                   /*!< Set PA13 function to BPWM1_CH3          */
#define SET_BPWM1_CH3_PA6()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_BPWM1_CH3)                     /*!< Set PA6 function to BPWM1_CH3           */
#define SET_BPWM1_CH3_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_BPWM1_CH3)                     /*!< Set PB8 function to BPWM1_CH3           */
#define SET_BPWM1_CH4_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_BPWM1_CH4)                   /*!< Set PA14 function to BPWM1_CH4          */
#define SET_BPWM1_CH4_PB7()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_BPWM1_CH4)                     /*!< Set PB7 function to BPWM1_CH4           */
#define SET_BPWM1_CH4_PC8()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_BPWM1_CH4)                     /*!< Set PC8 function to BPWM1_CH4           */
#define SET_BPWM1_CH5_PA15()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_BPWM1_CH5)                   /*!< Set PA15 function to BPWM1_CH5          */
#define SET_BPWM1_CH5_PB6()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_BPWM1_CH5)                     /*!< Set PB6 function to BPWM1_CH5           */
#define SET_BPWM1_CH5_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_BPWM1_CH5)                   /*!< Set PE13 function to BPWM1_CH5          */
#define SET_CAN0_RXD_PA13()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_CAN0_RXD)                    /*!< Set PA13 function to CAN0_RXD           */
#define SET_CAN0_RXD_PA4()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_CAN0_RXD)                      /*!< Set PA4 function to CAN0_RXD            */
#define SET_CAN0_RXD_PB10()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_CAN0_RXD)                    /*!< Set PB10 function to CAN0_RXD           */
#define SET_CAN0_RXD_PC4()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_CAN0_RXD)                      /*!< Set PC4 function to CAN0_RXD            */
#define SET_CAN0_RXD_PD10()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_CAN0_RXD)                    /*!< Set PD10 function to CAN0_RXD           */
#define SET_CAN0_RXD_PE15()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_CAN0_RXD)                    /*!< Set PE15 function to CAN0_RXD           */
#define SET_CAN0_RXD_PI13()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_CAN0_RXD)                    /*!< Set PI13 function to CAN0_RXD           */
#define SET_CAN0_RXD_PJ11()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_CAN0_RXD)                    /*!< Set PJ11 function to CAN0_RXD           */
#define SET_CAN0_RXD_PJ3()          SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_CAN0_RXD)                      /*!< Set PJ3 function to CAN0_RXD            */
#define SET_CAN0_TXD_PA12()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_CAN0_TXD)                    /*!< Set PA12 function to CAN0_TXD           */
#define SET_CAN0_TXD_PA5()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_CAN0_TXD)                      /*!< Set PA5 function to CAN0_TXD            */
#define SET_CAN0_TXD_PB11()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_CAN0_TXD)                    /*!< Set PB11 function to CAN0_TXD           */
#define SET_CAN0_TXD_PC5()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_CAN0_TXD)                      /*!< Set PC5 function to CAN0_TXD            */
#define SET_CAN0_TXD_PD11()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_CAN0_TXD)                    /*!< Set PD11 function to CAN0_TXD           */
#define SET_CAN0_TXD_PE14()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_CAN0_TXD)                    /*!< Set PE14 function to CAN0_TXD           */
#define SET_CAN0_TXD_PI12()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_CAN0_TXD)                    /*!< Set PI12 function to CAN0_TXD           */
#define SET_CAN0_TXD_PJ10()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_CAN0_TXD)                    /*!< Set PJ10 function to CAN0_TXD           */
#define SET_CAN0_TXD_PJ2()          SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_CAN0_TXD)                      /*!< Set PJ2 function to CAN0_TXD            */
#define SET_CAN1_RXD_PB6()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_CAN1_RXD)                      /*!< Set PB6 function to CAN1_RXD            */
#define SET_CAN1_RXD_PC2()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_CAN1_RXD)                      /*!< Set PC2 function to CAN1_RXD            */
#define SET_CAN1_RXD_PC9()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_CAN1_RXD)                      /*!< Set PC9 function to CAN1_RXD            */
#define SET_CAN1_RXD_PD12()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_CAN1_RXD)                    /*!< Set PD12 function to CAN1_RXD           */
#define SET_CAN1_RXD_PE6()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_CAN1_RXD)                      /*!< Set PE6 function to CAN1_RXD            */
#define SET_CAN1_RXD_PF8()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_CAN1_RXD)                      /*!< Set PF8 function to CAN1_RXD            */
#define SET_CAN1_RXD_PG1()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_CAN1_RXD)                      /*!< Set PG1 function to CAN1_RXD            */
#define SET_CAN1_RXD_PI15()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_CAN1_RXD)                    /*!< Set PI15 function to CAN1_RXD           */
#define SET_CAN1_RXD_PJ13()         SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ13MFP_Msk)) | SYS_GPJ_MFP3_PJ13MFP_CAN1_RXD)                    /*!< Set PJ13 function to CAN1_RXD           */
