OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_EPWM0_CH5_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_EPWM0_CH5)                     /*!< Set PE2 function to EPWM0_CH5           */
#define SET_EPWM0_CH5_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_EPWM0_CH5)                   /*!< Set PH11 function to EPWM0_CH5          */
#define SET_EPWM0_CH5_PH4()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_EPWM0_CH5)                     /*!< Set PH4 function to EPWM0_CH5           */
#define SET_EPWM0_SYNC_IN_PA15()    SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_EPWM0_SYNC_IN)               /*!< Set PA15 function to EPWM0_SYNC_IN      */
#define SET_EPWM0_SYNC_IN_PB6()     SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EPWM0_SYNC_IN)                 /*!< Set PB6 function to EPWM0_SYNC_IN       */
#define SET_EPWM0_SYNC_IN_PC14()    SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_EPWM0_SYNC_IN)               /*!< Set PC14 function to EPWM0_SYNC_IN      */
#define SET_EPWM0_SYNC_OUT_PA11()   SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_EPWM0_SYNC_OUT)              /*!< Set PA11 function to EPWM0_SYNC_OUT     */
#define SET_EPWM0_SYNC_OUT_PF5()    SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EPWM0_SYNC_OUT)                /*!< Set PF5 function to EPWM0_SYNC_OUT      */
#define SET_EPWM1_BRAKE0_PB7()      SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EPWM1_BRAKE0)                  /*!< Set PB7 function to EPWM1_BRAKE0        */
#define SET_EPWM1_BRAKE0_PE10()     SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EPWM1_BRAKE0)                /*!< Set PE10 function to EPWM1_BRAKE0       */
#define SET_EPWM1_BRAKE1_PA3()      SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_EPWM1_BRAKE1)                  /*!< Set PA3 function to EPWM1_BRAKE1        */
#define SET_EPWM1_BRAKE1_PB6()      SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EPWM1_BRAKE1)                  /*!< Set PB6 function to EPWM1_BRAKE1        */
#define SET_EPWM1_BRAKE1_PE11()     SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_EPWM1_BRAKE1)                /*!< Set PE11 function to EPWM1_BRAKE1       */
#define SET_EPWM1_CH0_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_EPWM1_CH0)                   /*!< Set PB15 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_EPWM1_CH0)                   /*!< Set PC12 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_EPWM1_CH0)                     /*!< Set PC5 function to EPWM1_CH0           */
#define SET_EPWM1_CH0_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_EPWM1_CH0)                   /*!< Set PE13 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PF3()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_EPWM1_CH0)                     /*!< Set PF3 function to EPWM1_CH0           */
#define SET_EPWM1_CH0_PI12()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_EPWM1_CH0)                   /*!< Set PI12 function to EPWM1_CH0          */
#define SET_EPWM1_CH1_PB14()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_EPWM1_CH1)                   /*!< Set PB14 function to EPWM1_CH1          */
#define SET_EPWM1_CH1_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_EPWM1_CH1)                   /*!< Set PC11 function to EPWM1_CH1          */
#define SET_EPWM1_CH1_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_EPWM1_CH1)                     /*!< Set PC4 function to EPWM1_CH1           */
#define SET_EPWM1_CH1_PC8()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_EPWM1_CH1)                     /*!< Set PC8 function to EPWM1_CH1           */
#define SET_EPWM1_CH1_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_EPWM1_CH1)                     /*!< Set PF2 function to EPWM1_CH1           */
#define SET_EPWM1_CH1_PI13()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_EPWM1_CH1)                   /*!< Set PI13 function to EPWM1_CH1          */
#define SET_EPWM1_CH2_PB13()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_EPWM1_CH2)                   /*!< Set PB13 function to EPWM1_CH2          */
#define SET_EPWM1_CH2_PC10()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_EPWM1_CH2)                   /*!< Set PC10 function to EPWM1_CH2          */
#define SET_EPWM1_CH2_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_EPWM1_CH2)                     /*!< Set PC3 function to EPWM1_CH2           */
#define SET_EPWM1_CH2_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_EPWM1_CH2)                     /*!< Set PC7 function to EPWM1_CH2           */
#define SET_EPWM1_CH2_PI14()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_EPWM1_CH2)                   /*!< Set PI14 function to EPWM1_CH2          */
#define SET_EPWM1_CH3_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_EPWM1_CH3)                   /*!< Set PB12 function to EPWM1_CH3          */
#define SET_EPWM1_CH3_PC2()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_EPWM1_CH3)                     /*!< Set PC2 function to EPWM1_CH3           */
#define SET_EPWM1_CH3_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_EPWM1_CH3)                     /*!< Set PC6 function to EPWM1_CH3           */
#define SET_EPWM1_CH3_PC9()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_EPWM1_CH3)                     /*!< Set PC9 function to EPWM1_CH3           */
#define SET_EPWM1_CH3_PI15()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_EPWM1_CH3)                   /*!< Set PI15 function to EPWM1_CH3          */
#define SET_EPWM1_CH4_PA7()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_EPWM1_CH4)                     /*!< Set PA7 function to EPWM1_CH4           */
#define SET_EPWM1_CH4_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EPWM1_CH4)                     /*!< Set PB1 function to EPWM1_CH4           */
#define SET_EPWM1_CH4_PB7()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EPWM1_CH4)                     /*!< Set PB7 function to EPWM1_CH4           */
#define SET_EPWM1_CH4_PC1()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_EPWM1_CH4)                     /*!< Set PC1 function to EPWM1_CH4           */
#define SET_EPWM1_CH4_PF0()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_EPWM1_CH4)                     /*!< Set PF0 function to EPWM1_CH4           */
#define SET_EPWM1_CH4_PJ0()         SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ0MFP_Msk)) | SYS_GPJ_MFP0_PJ0MFP_EPWM1_CH4)                     /*!< Set PJ0 function to EPWM1_CH4           */
#define SET_EPWM1_CH5_PA6()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_EPWM1_CH5)                     /*!< Set PA6 function to EPWM1_CH5           */
#define SET_EPWM1_CH5_PB0()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_EPWM1_CH5)                     /*!< Set PB0 function to EPWM1_CH5           */
#define SET_EPWM1_CH5_PB6()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EPWM1_CH5)                     /*!< Set PB6 function to EPWM1_CH5           */
#define SET_EPWM1_CH5_PC0()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_EPWM1_CH5)                     /*!< Set PC0 function to EPWM1_CH5           */
#define SET_EPWM1_CH5_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_EPWM1_CH5)                     /*!< Set PF1 function to EPWM1_CH5           */
#define SET_EPWM1_CH5_PJ1()         SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ1MFP_Msk)) | SYS_GPJ_MFP0_PJ1MFP_EPWM1_CH5)                     /*!< Set PJ1 function to EPWM1_CH5           */
#define SET_EQEI0_A_PA4()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_EQEI0_A)                       /*!< Set PA4 function to EQEI0_A             */
#define SET_EQEI0_A_PD11()          SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_EQEI0_A)                     /*!< Set PD11 function to EQEI0_A            */
#define SET_EQEI0_A_PE3()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_EQEI0_A)                       /*!< Set PE3 function to EQEI0_A             */
#define SET_EQEI0_B_PA3()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_EQEI0_B)                       /*!< Set PA3 function to EQEI0_B             */
#define SET_EQEI0_B_PD10()          SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_EQEI0_B)                     /*!< Set PD10 function to EQEI0_B            */
#define SET_EQEI0_B_PE2()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_EQEI0_B)                       /*!< Set PE2 function to EQEI0_B             */
#define SET_EQEI0_INDEX_PA5()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_EQEI0_INDEX)                   /*!< Set PA5 function to EQEI0_INDEX         */
#define SET_EQEI0_INDEX_PD12()      SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_EQEI0_INDEX)                 /*!< Set PD12 function to EQEI0_INDEX        */
#define SET_EQEI0_INDEX_PE4()       SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_EQEI0_INDEX)                   /*!< Set PE4 function to EQEI0_INDEX         */
#define SET_EQEI1_A_PA13()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_EQEI1_A)                     /*!< Set PA13 function to EQEI1_A            */
#define SET_EQEI1_A_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_EQEI1_A)                       /*!< Set PA9 function to EQEI1_A             */
#define SET_EQEI1_A_PE6()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_EQEI1_A)                       /*!< Set PE6 function to EQEI1_A             */
#define SET_EQEI1_B_PA14()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_EQEI1_B)                     /*!< Set PA14 function to EQEI1_B            */
#define SET_EQEI1_B_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_EQEI1_B)                       /*!< Set PA8 function to EQEI1_B             */
#define SET_EQEI1_B_PE5()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_EQEI1_B)                       /*!< Set PE5 function to EQEI1_B             */
#define SET_EQEI1_INDEX_PA10()      SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_EQEI1_INDEX)                 /*!< Set PA10 function to EQEI1_INDEX        */
#define SET_EQEI1_INDEX_PA12()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_EQEI1_INDEX)                 /*!< Set PA12 function to EQEI1_INDEX        */
#define SET_EQEI1_INDEX_PE7()       SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_EQEI1_INDEX)                   /*!< Set PE7 function to EQEI1_INDEX         */
#define SET_EQEI2_A_PD0()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_EQEI2_A)                       /*!< Set PD0 function to EQEI2_A             */
#define SET_EQEI2_A_PE9()           SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_EQEI2_A)                       /*!< Set PE9 function to EQEI2_A             */
#define SET_EQEI2_A_PF5()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EQEI2_A)                       /*!< Set PF5 function to EQEI2_A             */
#define SET_EQEI2_B_PD13()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_EQEI2_B)                     /*!< Set PD13 function to EQEI2_B            */
#define SET_EQEI2_B_PE10()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EQEI2_B)                     /*!< Set PE10 function to EQEI2_B            */
#define SET_EQEI2_B_PF4()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_EQEI2_B)                       /*!< Set PF4 function to EQEI2_B             */
#define SET_EQEI2_INDEX_PD1()       SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_EQEI2_INDEX)                   /*!< Set PD1 function to EQEI2_INDEX         */
#define SET_EQEI2_INDEX_PE8()       SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_EQEI2_INDEX)                   /*!< Set PE8 function to EQEI2_INDEX         */
#define SET_EQEI2_INDEX_PF6()       SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_EQEI2_INDEX)                   /*!< Set PF6 function to EQEI2_INDEX         */
#define SET_EQEI3_A_PA1()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_EQEI3_A)                       /*!< Set PA1 function to EQEI3_A             */
#define SET_EQEI3_A_PD3()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_EQEI3_A)                       /*!< Set PD3 function to EQEI3_A             */
#define SET_EQEI3_B_PA0()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_EQEI3_B)                       /*!< Set PA0 function to EQEI3_B             */
#define SET_EQEI3_B_PD2()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_EQEI3_B)                       /*!< Set PD2 function to EQEI3_B             */
#define SET_EQEI3_INDEX_PA15()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_EQEI3_INDEX)                 /*!< Set PA15 function to EQEI3_INDEX        */
#define SET_EQEI3_INDEX_PA2()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_EQEI3_INDEX)                   /*!< Set PA2 function to EQEI3_INDEX         */
#define SET_ETMC_TRACE_CLK_PB11()   SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_ETMC_TRACE_CLK)              /*!< Set PB11 function to ETMC_TRACE_CLK     */
#define SET_ETMC_TRACE_CLK_PC14()   SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_ETMC_TRACE_CLK)              /*!< Set PC14 function to ETMC_TRACE_CLK     */
#define SET_ETMC_TRACE_DATA0_PB10() SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_ETMC_TRACE_DATA0)            /*!< Set PB10 function to ETMC_TRACE_DATA0   */
#define SET_ETMC_TRACE_DATA0_PB15() SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_ETMC_TRACE_DATA0)            /*!< Set PB15 function to ETMC_TRACE_DATA0   */
#define SET_ETMC_TRACE_DATA1_PB14() SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_ETMC_TRACE_DATA1)            /*!< Set PB14 function to ETMC_TRACE_DATA1   */
#define SET_ETMC_TRACE_DATA1_PB9()  SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_ETMC_TRACE_DATA1)              /*!< Set PB9 function to ETMC_TRACE_DATA1    */
#define SET_ETMC_TRACE_DATA2_PB13() SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_ETMC_TRACE_DATA2)            /*!< Set PB13 function to ETMC_TRACE_DATA2   */
#define SET_ETMC_TRACE_DATA2_PB8()  SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_ETMC_TRACE_DATA2)              /*!< Set PB8 function to ETMC_TRACE_DATA2    */
#define SET_ETMC_TRACE_DATA3_PB12() SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_ETMC_TRACE_DATA3)            /*!< Set PB12 function to ETMC_TRACE_DATA3   */
#define SET_ETMC_TRACE_DATA3_PB7()  SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_ETMC_TRACE_DATA3)              /*!< Set PB7 function to ETMC_TRACE_DATA3    */
#define SET_GPIO_PA0()              SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_GPIO)                          /*!< Set PA0 function to GPIO                */
#define SET_GPIO_PA1()              SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_GPIO)                          /*!< Set PA1 function to GPIO                */
#define SET_GPIO_PA10()             SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_GPIO)                        /*!< Set PA10 function to GPIO               */
#define SET_GPIO_PA11()             SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_GPIO)                        /*!< Set PA11 function to GPIO               */
#define SET_GPIO_PA12()             SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_GPIO)                        /*!< Set PA12 function to GPIO               */
#define SET_GPIO_PA13()             SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_GPIO)                        /*!< Set PA13 function to GPIO               */
#define SET_GPIO_PA14()             SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_GPIO)                        /*!< Set PA14 function to GPIO               */
#define SET_GPIO_PA15()             SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_GPIO)                        /*!< Set PA15 function to GPIO               */
#define SET_GPIO_PA2()              SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_GPIO)                          /*!< Set PA2 function to GPIO                */
#define SET_GPIO_PA3()              SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_GPIO)                          /*!< Set PA3 function to GPIO                */
#define SET_GPIO_PA4()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_GPIO)                          /*!< Set PA4 function to GPIO                */
#define SET_GPIO_PA5()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_GPIO)                          /*!< Set PA5 function to GPIO                */
#define SET_GPIO_PA6()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_GPIO)                          /*!< Set PA6 function to GPIO                */
#define SET_GPIO_PA7()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_GPIO)                          /*!< Set PA7 function to GPIO                */
#define SET_GPIO_PA8()              SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_GPIO)                          /*!< Set PA8 function to GPIO                */
#define SET_GPIO_PA9()              SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_GPIO)                          /*!< Set PA9 function to GPIO                */
#define SET_GPIO_PB0()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_GPIO)                          /*!< Set PB0 function to GPIO                */
#define SET_GPIO_PB1()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_GPIO)                          /*!< Set PB1 function to GPIO                */
#define SET_GPIO_PB10()             SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_GPIO)                        /*!< Set PB10 function to GPIO               */
#define SET_GPIO_PB11()             SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_GPIO)                        /*!< Set PB11 function to GPIO               */
#define SET_GPIO_PB12()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_GPIO)                        /*!< Set PB12 function to GPIO               */
#define SET_GPIO_PB13()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_GPIO)                        /*!< Set PB13 function to GPIO               */
#define SET_GPIO_PB14()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_GPIO)                        /*!< Set PB14 function to GPIO               */
#define SET_GPIO_PB15()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_GPIO)                        /*!< Set PB15 function to GPIO               */
#define SET_GPIO_PB2()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_GPIO)                          /*!< Set PB2 function to GPIO                */
#define SET_GPIO_PB3()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_GPIO)                          /*!< Set PB3 function to GPIO                */
#define SET_GPIO_PB4()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_GPIO)                          /*!< Set PB4 function to GPIO                */
#define SET_GPIO_PB5()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_GPIO)                          /*!< Set PB5 function to GPIO                */
#define SET_GPIO_PB6()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_GPIO)                          /*!< Set PB6 function to GPIO                */
#define SET_GPIO_PB7()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_GPIO)                          /*!< Set PB7 function to GPIO                */
