OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_I2S0_DI_PH8()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_I2S0_DI)                       /*!< Set PH8 function to I2S0_DI             */
#define SET_I2S0_DI_PI8()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_I2S0_DI)                       /*!< Set PI8 function to I2S0_DI             */
#define SET_I2S0_DO_PA15()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_I2S0_DO)                     /*!< Set PA15 function to I2S0_DO            */
#define SET_I2S0_DO_PB2()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_I2S0_DO)                       /*!< Set PB2 function to I2S0_DO             */
#define SET_I2S0_DO_PC1()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_I2S0_DO)                       /*!< Set PC1 function to I2S0_DO             */
#define SET_I2S0_DO_PE11()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_I2S0_DO)                     /*!< Set PE11 function to I2S0_DO            */
#define SET_I2S0_DO_PF0()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_I2S0_DO)                       /*!< Set PF0 function to I2S0_DO             */
#define SET_I2S0_DO_PF7()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_I2S0_DO)                       /*!< Set PF7 function to I2S0_DO             */
#define SET_I2S0_DO_PH9()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_I2S0_DO)                       /*!< Set PH9 function to I2S0_DO             */
#define SET_I2S0_DO_PI9()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_I2S0_DO)                       /*!< Set PI9 function to I2S0_DO             */
#define SET_I2S0_LRCK_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_I2S0_LRCK)                     /*!< Set PB1 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PC0()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_I2S0_LRCK)                     /*!< Set PC0 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_I2S0_LRCK)                   /*!< Set PE12 function to I2S0_LRCK          */
#define SET_I2S0_LRCK_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_I2S0_LRCK)                     /*!< Set PF1 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_I2S0_LRCK)                     /*!< Set PF6 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PH10()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_I2S0_LRCK)                   /*!< Set PH10 function to I2S0_LRCK          */
#define SET_I2S0_LRCK_PI10()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_I2S0_LRCK)                   /*!< Set PI10 function to I2S0_LRCK          */
#define SET_I2S0_MCLK_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_I2S0_MCLK)                   /*!< Set PA13 function to I2S0_MCLK          */
#define SET_I2S0_MCLK_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_I2S0_MCLK)                     /*!< Set PB4 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_I2S0_MCLK)                     /*!< Set PC3 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PE0()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_I2S0_MCLK)                     /*!< Set PE0 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_I2S0_MCLK)                     /*!< Set PE2 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_I2S0_MCLK)                     /*!< Set PE9 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PF9()         SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_I2S0_MCLK)                     /*!< Set PF9 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PI7()         SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_I2S0_MCLK)                     /*!< Set PI7 function to I2S0_MCLK           */
#define SET_I2S1_BCLK_PA11()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_I2S1_BCLK)                   /*!< Set PA11 function to I2S1_BCLK          */
#define SET_I2S1_BCLK_PD14()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_I2S1_BCLK)                   /*!< Set PD14 function to I2S1_BCLK          */
#define SET_I2S1_BCLK_PD3()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_I2S1_BCLK)                     /*!< Set PD3 function to I2S1_BCLK           */
#define SET_I2S1_BCLK_PH7()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH7MFP_Msk)) | SYS_GPH_MFP1_PH7MFP_I2S1_BCLK)                     /*!< Set PH7 function to I2S1_BCLK           */
#define SET_I2S1_DI_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_I2S1_DI)                       /*!< Set PA9 function to I2S1_DI             */
#define SET_I2S1_DI_PD1()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_I2S1_DI)                       /*!< Set PD1 function to I2S1_DI             */
#define SET_I2S1_DI_PG6()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_I2S1_DI)                       /*!< Set PG6 function to I2S1_DI             */
#define SET_I2S1_DO_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_I2S1_DO)                       /*!< Set PA8 function to I2S1_DO             */
#define SET_I2S1_DO_PD0()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_I2S1_DO)                       /*!< Set PD0 function to I2S1_DO             */
#define SET_I2S1_DO_PG0()           SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_I2S1_DO)                       /*!< Set PG0 function to I2S1_DO             */
#define SET_I2S1_DO_PG7()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_I2S1_DO)                       /*!< Set PG7 function to I2S1_DO             */
#define SET_I2S1_LRCK_PB0()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_I2S1_LRCK)                     /*!< Set PB0 function to I2S1_LRCK           */
#define SET_I2S1_LRCK_PD13()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_I2S1_LRCK)                   /*!< Set PD13 function to I2S1_LRCK          */
#define SET_I2S1_LRCK_PG1()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_I2S1_LRCK)                     /*!< Set PG1 function to I2S1_LRCK           */
#define SET_I2S1_LRCK_PG8()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_I2S1_LRCK)                     /*!< Set PG8 function to I2S1_LRCK           */
#define SET_I2S1_MCLK_PA10()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_I2S1_MCLK)                   /*!< Set PA10 function to I2S1_MCLK          */
#define SET_I2S1_MCLK_PD2()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_I2S1_MCLK)                     /*!< Set PD2 function to I2S1_MCLK           */
#define SET_I2S1_MCLK_PG5()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_I2S1_MCLK)                     /*!< Set PG5 function to I2S1_MCLK           */
#define SET_I3C0_PUPEN_PA2()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_I3C0_PUPEN)                    /*!< Set PA2 function to I3C0_PUPEN          */
#define SET_I3C0_PUPEN_PC5()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_I3C0_PUPEN)                    /*!< Set PC5 function to I3C0_PUPEN          */
#define SET_I3C0_PUPEN_PC9()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_I3C0_PUPEN)                    /*!< Set PC9 function to I3C0_PUPEN          */
#define SET_I3C0_PUPEN_PH10()       SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_I3C0_PUPEN)                  /*!< Set PH10 function to I3C0_PUPEN         */
#define SET_I3C0_SCL_PA1()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_I3C0_SCL)                      /*!< Set PA1 function to I3C0_SCL            */
#define SET_I3C0_SCL_PA5()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_I3C0_SCL)                      /*!< Set PA5 function to I3C0_SCL            */
#define SET_I3C0_SCL_PB1()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_I3C0_SCL)                      /*!< Set PB1 function to I3C0_SCL            */
#define SET_I3C0_SCL_PF0()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_I3C0_SCL)                      /*!< Set PF0 function to I3C0_SCL            */
#define SET_I3C0_SCL_PH8()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_I3C0_SCL)                      /*!< Set PH8 function to I3C0_SCL            */
#define SET_I3C0_SDA_PA0()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_I3C0_SDA)                      /*!< Set PA0 function to I3C0_SDA            */
#define SET_I3C0_SDA_PA4()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_I3C0_SDA)                      /*!< Set PA4 function to I3C0_SDA            */
#define SET_I3C0_SDA_PB0()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_I3C0_SDA)                      /*!< Set PB0 function to I3C0_SDA            */
#define SET_I3C0_SDA_PF1()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_I3C0_SDA)                      /*!< Set PF1 function to I3C0_SDA            */
#define SET_I3C0_SDA_PH9()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_I3C0_SDA)                      /*!< Set PH9 function to I3C0_SDA            */
#define SET_ICE_CLK_PF1()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_ICE_CLK)                       /*!< Set PF1 function to ICE_CLK             */
#define SET_ICE_DAT_PF0()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_ICE_DAT)                       /*!< Set PF0 function to ICE_DAT             */
#define SET_INT0_PA6()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_INT0)                          /*!< Set PA6 function to INT0                */
#define SET_INT0_PB5()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_INT0)                          /*!< Set PB5 function to INT0                */
#define SET_INT1_PA7()              SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_INT1)                          /*!< Set PA7 function to INT1                */
#define SET_INT1_PB4()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_INT1)                          /*!< Set PB4 function to INT1                */
#define SET_INT2_PB3()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_INT2)                          /*!< Set PB3 function to INT2                */
#define SET_INT2_PC6()              SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_INT2)                          /*!< Set PC6 function to INT2                */
#define SET_INT3_PB2()              SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_INT3)                          /*!< Set PB2 function to INT3                */
#define SET_INT3_PC7()              SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_INT3)                          /*!< Set PC7 function to INT3                */
#define SET_INT4_PA8()              SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_INT4)                          /*!< Set PA8 function to INT4                */
#define SET_INT4_PB6()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_INT4)                          /*!< Set PB6 function to INT4                */
#define SET_INT5_PB7()              SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_INT5)                          /*!< Set PB7 function to INT5                */
#define SET_INT5_PD12()             SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_INT5)                        /*!< Set PD12 function to INT5               */
#define SET_INT6_PB8()              SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_INT6)                          /*!< Set PB8 function to INT6                */
#define SET_INT6_PD11()             SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_INT6)                        /*!< Set PD11 function to INT6               */
#define SET_INT7_PB9()              SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_INT7)                          /*!< Set PB9 function to INT7                */
#define SET_INT7_PD10()             SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_INT7)                        /*!< Set PD10 function to INT7               */
#define SET_KPI_COL0_PA6()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_KPI_COL0)                      /*!< Set PA6 function to KPI_COL0            */
#define SET_KPI_COL0_PB15()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_KPI_COL0)                    /*!< Set PB15 function to KPI_COL0           */
#define SET_KPI_COL0_PF5()          SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_KPI_COL0)                      /*!< Set PF5 function to KPI_COL0            */
#define SET_KPI_COL1_PA7()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_KPI_COL1)                      /*!< Set PA7 function to KPI_COL1            */
#define SET_KPI_COL1_PB14()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_KPI_COL1)                    /*!< Set PB14 function to KPI_COL1           */
#define SET_KPI_COL1_PF4()          SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_KPI_COL1)                      /*!< Set PF4 function to KPI_COL1            */
#define SET_KPI_COL2_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_KPI_COL2)                    /*!< Set PB13 function to KPI_COL2           */
#define SET_KPI_COL2_PC6()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_KPI_COL2)                      /*!< Set PC6 function to KPI_COL2            */
#define SET_KPI_COL3_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_KPI_COL3)                    /*!< Set PB12 function to KPI_COL3           */
#define SET_KPI_COL3_PC7()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_KPI_COL3)                      /*!< Set PC7 function to KPI_COL3            */
#define SET_KPI_COL4_PB7()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_KPI_COL4)                      /*!< Set PB7 function to KPI_COL4            */
#define SET_KPI_COL4_PC8()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_KPI_COL4)                      /*!< Set PC8 function to KPI_COL4            */
#define SET_KPI_COL5_PB6()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_KPI_COL5)                      /*!< Set PB6 function to KPI_COL5            */
#define SET_KPI_COL5_PE13()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_KPI_COL5)                    /*!< Set PE13 function to KPI_COL5           */
#define SET_KPI_COL6_PB5()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_KPI_COL6)                      /*!< Set PB5 function to KPI_COL6            */
#define SET_KPI_COL6_PE12()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_KPI_COL6)                    /*!< Set PE12 function to KPI_COL6           */
#define SET_KPI_COL7_PB4()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_KPI_COL7)                      /*!< Set PB4 function to KPI_COL7            */
#define SET_KPI_COL7_PE11()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_KPI_COL7)                    /*!< Set PE11 function to KPI_COL7           */
#define SET_KPI_ROW0_PB3()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_KPI_ROW0)                      /*!< Set PB3 function to KPI_ROW0            */
#define SET_KPI_ROW0_PC5()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_KPI_ROW0)                      /*!< Set PC5 function to KPI_ROW0            */
#define SET_KPI_ROW1_PB2()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_KPI_ROW1)                      /*!< Set PB2 function to KPI_ROW1            */
#define SET_KPI_ROW1_PC4()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_KPI_ROW1)                      /*!< Set PC4 function to KPI_ROW1            */
#define SET_KPI_ROW2_PB1()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_KPI_ROW2)                      /*!< Set PB1 function to KPI_ROW2            */
#define SET_KPI_ROW2_PC3()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_KPI_ROW2)                      /*!< Set PC3 function to KPI_ROW2            */
#define SET_KPI_ROW3_PB0()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_KPI_ROW3)                      /*!< Set PB0 function to KPI_ROW3            */
#define SET_KPI_ROW3_PC2()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_KPI_ROW3)                      /*!< Set PC2 function to KPI_ROW3            */
#define SET_KPI_ROW4_PA11()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_KPI_ROW4)                    /*!< Set PA11 function to KPI_ROW4           */
#define SET_KPI_ROW4_PC1()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_KPI_ROW4)                      /*!< Set PC1 function to KPI_ROW4            */
#define SET_KPI_ROW5_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_KPI_ROW5)                    /*!< Set PA10 function to KPI_ROW5           */
#define SET_KPI_ROW5_PC0()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_KPI_ROW5)                      /*!< Set PC0 function to KPI_ROW5            */
#define SET_LPADC0_CH0_PB0()        SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_LPADC0_CH0)                    /*!< Set PB0 function to LPADC0_CH0          */
#define SET_LPADC0_CH10_PB10()      SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_LPADC0_CH10)                 /*!< Set PB10 function to LPADC0_CH10        */
#define SET_LPADC0_CH11_PB11()      SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_LPADC0_CH11)                 /*!< Set PB11 function to LPADC0_CH11        */
#define SET_LPADC0_CH12_PB12()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_LPADC0_CH12)                 /*!< Set PB12 function to LPADC0_CH12        */
#define SET_LPADC0_CH13_PB13()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_LPADC0_CH13)                 /*!< Set PB13 function to LPADC0_CH13        */
#define SET_LPADC0_CH14_PB14()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_LPADC0_CH14)                 /*!< Set PB14 function to LPADC0_CH14        */
#define SET_LPADC0_CH15_PB15()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_LPADC0_CH15)                 /*!< Set PB15 function to LPADC0_CH15        */
#define SET_LPADC0_CH16_PD10()      SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_LPADC0_CH16)                 /*!< Set PD10 function to LPADC0_CH16        */
#define SET_LPADC0_CH17_PD11()      SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_LPADC0_CH17)                 /*!< Set PD11 function to LPADC0_CH17        */
#define SET_LPADC0_CH18_PD12()      SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_LPADC0_CH18)                 /*!< Set PD12 function to LPADC0_CH18        */
#define SET_LPADC0_CH19_PC13()      SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_LPADC0_CH19)                 /*!< Set PC13 function to LPADC0_CH19        */
#define SET_LPADC0_CH1_PB1()        SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_LPADC0_CH1)                    /*!< Set PB1 function to LPADC0_CH1          */
#define SET_LPADC0_CH20_PA8()       SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_LPADC0_CH20)                   /*!< Set PA8 function to LPADC0_CH20         */
#define SET_LPADC0_CH21_PA9()       SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_LPADC0_CH21)                   /*!< Set PA9 function to LPADC0_CH21         */
#define SET_LPADC0_CH22_PA10()      SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_LPADC0_CH22)                 /*!< Set PA10 function to LPADC0_CH22        */
