OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_SC1_RST_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_SC1_RST)                       /*!< Set PF2 function to SC1_RST             */
#define SET_SC1_RST_PG6()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_SC1_RST)                       /*!< Set PG6 function to SC1_RST             */
#define SET_SC1_RST_PI8()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_SC1_RST)                       /*!< Set PI8 function to SC1_RST             */
#define SET_SC1_nCD_PB6()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_SC1_nCD)                       /*!< Set PB6 function to SC1_nCD             */
#define SET_SC1_nCD_PC14()          SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_SC1_nCD)                     /*!< Set PC14 function to SC1_nCD            */
#define SET_SC1_nCD_PC4()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_SC1_nCD)                       /*!< Set PC4 function to SC1_nCD             */
#define SET_SC1_nCD_PD14()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_SC1_nCD)                     /*!< Set PD14 function to SC1_nCD            */
#define SET_SC1_nCD_PD3()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_SC1_nCD)                       /*!< Set PD3 function to SC1_nCD             */
#define SET_SC1_nCD_PG2()           SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_SC1_nCD)                       /*!< Set PG2 function to SC1_nCD             */
#define SET_SC1_nCD_PI6()           SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_SC1_nCD)                       /*!< Set PI6 function to SC1_nCD             */
#define SET_SC2_CLK_PA15()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_SC2_CLK)                     /*!< Set PA15 function to SC2_CLK            */
#define SET_SC2_CLK_PA6()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_SC2_CLK)                       /*!< Set PA6 function to SC2_CLK             */
#define SET_SC2_CLK_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_SC2_CLK)                       /*!< Set PA8 function to SC2_CLK             */
#define SET_SC2_CLK_PD0()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_SC2_CLK)                       /*!< Set PD0 function to SC2_CLK             */
#define SET_SC2_CLK_PE0()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_SC2_CLK)                       /*!< Set PE0 function to SC2_CLK             */
#define SET_SC2_CLK_PE2()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SC2_CLK)                       /*!< Set PE2 function to SC2_CLK             */
#define SET_SC2_DAT_PA14()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_SC2_DAT)                     /*!< Set PA14 function to SC2_DAT            */
#define SET_SC2_DAT_PA7()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_SC2_DAT)                       /*!< Set PA7 function to SC2_DAT             */
#define SET_SC2_DAT_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SC2_DAT)                       /*!< Set PA9 function to SC2_DAT             */
#define SET_SC2_DAT_PD1()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_SC2_DAT)                       /*!< Set PD1 function to SC2_DAT             */
#define SET_SC2_DAT_PE1()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_SC2_DAT)                       /*!< Set PE1 function to SC2_DAT             */
#define SET_SC2_DAT_PE3()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SC2_DAT)                       /*!< Set PE3 function to SC2_DAT             */
#define SET_SC2_PWR_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_SC2_PWR)                     /*!< Set PA11 function to SC2_PWR            */
#define SET_SC2_PWR_PA12()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_SC2_PWR)                     /*!< Set PA12 function to SC2_PWR            */
#define SET_SC2_PWR_PC7()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_SC2_PWR)                       /*!< Set PC7 function to SC2_PWR             */
#define SET_SC2_PWR_PD3()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_SC2_PWR)                       /*!< Set PD3 function to SC2_PWR             */
#define SET_SC2_PWR_PH8()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_SC2_PWR)                       /*!< Set PH8 function to SC2_PWR             */
#define SET_SC2_RST_PA10()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_SC2_RST)                     /*!< Set PA10 function to SC2_RST            */
#define SET_SC2_RST_PA13()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_SC2_RST)                     /*!< Set PA13 function to SC2_RST            */
#define SET_SC2_RST_PC6()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_SC2_RST)                       /*!< Set PC6 function to SC2_RST             */
#define SET_SC2_RST_PD2()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_SC2_RST)                       /*!< Set PD2 function to SC2_RST             */
#define SET_SC2_RST_PH9()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_SC2_RST)                       /*!< Set PH9 function to SC2_RST             */
#define SET_SC2_nCD_PA5()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_SC2_nCD)                       /*!< Set PA5 function to SC2_nCD             */
#define SET_SC2_nCD_PC13()          SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_SC2_nCD)                     /*!< Set PC13 function to SC2_nCD            */
#define SET_SC2_nCD_PD13()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_SC2_nCD)                     /*!< Set PD13 function to SC2_nCD            */
#define SET_SC2_nCD_PH10()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_SC2_nCD)                     /*!< Set PH10 function to SC2_nCD            */
#define SET_SD0_CLK_PB1()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_SD0_CLK)                       /*!< Set PB1 function to SD0_CLK             */
#define SET_SD0_CLK_PE6()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_SD0_CLK)                       /*!< Set PE6 function to SD0_CLK             */
#define SET_SD0_CMD_PB0()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_SD0_CMD)                       /*!< Set PB0 function to SD0_CMD             */
#define SET_SD0_CMD_PE7()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_SD0_CMD)                       /*!< Set PE7 function to SD0_CMD             */
#define SET_SD0_DAT0_PB2()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_SD0_DAT0)                      /*!< Set PB2 function to SD0_DAT0            */
#define SET_SD0_DAT0_PE2()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SD0_DAT0)                      /*!< Set PE2 function to SD0_DAT0            */
#define SET_SD0_DAT1_PB3()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_SD0_DAT1)                      /*!< Set PB3 function to SD0_DAT1            */
#define SET_SD0_DAT1_PE3()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SD0_DAT1)                      /*!< Set PE3 function to SD0_DAT1            */
#define SET_SD0_DAT2_PB4()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_SD0_DAT2)                      /*!< Set PB4 function to SD0_DAT2            */
#define SET_SD0_DAT2_PE4()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_SD0_DAT2)                      /*!< Set PE4 function to SD0_DAT2            */
#define SET_SD0_DAT3_PB5()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_SD0_DAT3)                      /*!< Set PB5 function to SD0_DAT3            */
#define SET_SD0_DAT3_PE5()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_SD0_DAT3)                      /*!< Set PE5 function to SD0_DAT3            */
#define SET_SD0_nCD_PB12()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SD0_nCD)                     /*!< Set PB12 function to SD0_nCD            */
#define SET_SD0_nCD_PD13()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_SD0_nCD)                     /*!< Set PD13 function to SD0_nCD            */
#define SET_SD1_CLK_PA4()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_SD1_CLK)                       /*!< Set PA4 function to SD1_CLK             */
#define SET_SD1_CLK_PB6()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_SD1_CLK)                       /*!< Set PB6 function to SD1_CLK             */
#define SET_SD1_CLK_PD13()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_SD1_CLK)                     /*!< Set PD13 function to SD1_CLK            */
#define SET_SD1_CLK_PG14()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_SD1_CLK)                     /*!< Set PG14 function to SD1_CLK            */
#define SET_SD1_CLK_PJ13()          SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ13MFP_Msk)) | SYS_GPJ_MFP3_PJ13MFP_SD1_CLK)                     /*!< Set PJ13 function to SD1_CLK            */
#define SET_SD1_CMD_PA5()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_SD1_CMD)                       /*!< Set PA5 function to SD1_CMD             */
#define SET_SD1_CMD_PB7()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_SD1_CMD)                       /*!< Set PB7 function to SD1_CMD             */
#define SET_SD1_CMD_PG13()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_SD1_CMD)                     /*!< Set PG13 function to SD1_CMD            */
#define SET_SD1_CMD_PJ12()          SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_SD1_CMD)                     /*!< Set PJ12 function to SD1_CMD            */
#define SET_SD1_DAT0_PA0()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_SD1_DAT0)                      /*!< Set PA0 function to SD1_DAT0            */
#define SET_SD1_DAT0_PA8()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_SD1_DAT0)                      /*!< Set PA8 function to SD1_DAT0            */
#define SET_SD1_DAT0_PG12()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_SD1_DAT0)                    /*!< Set PG12 function to SD1_DAT0           */
#define SET_SD1_DAT0_PJ11()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_SD1_DAT0)                    /*!< Set PJ11 function to SD1_DAT0           */
#define SET_SD1_DAT1_PA1()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_SD1_DAT1)                      /*!< Set PA1 function to SD1_DAT1            */
#define SET_SD1_DAT1_PA9()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SD1_DAT1)                      /*!< Set PA9 function to SD1_DAT1            */
#define SET_SD1_DAT1_PG11()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_SD1_DAT1)                    /*!< Set PG11 function to SD1_DAT1           */
#define SET_SD1_DAT1_PJ10()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_SD1_DAT1)                    /*!< Set PJ10 function to SD1_DAT1           */
#define SET_SD1_DAT2_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_SD1_DAT2)                    /*!< Set PA10 function to SD1_DAT2           */
#define SET_SD1_DAT2_PA2()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_SD1_DAT2)                      /*!< Set PA2 function to SD1_DAT2            */
#define SET_SD1_DAT2_PG10()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_SD1_DAT2)                    /*!< Set PG10 function to SD1_DAT2           */
#define SET_SD1_DAT2_PJ9()          SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ9MFP_Msk)) | SYS_GPJ_MFP2_PJ9MFP_SD1_DAT2)                      /*!< Set PJ9 function to SD1_DAT2            */
#define SET_SD1_DAT3_PA11()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_SD1_DAT3)                    /*!< Set PA11 function to SD1_DAT3           */
#define SET_SD1_DAT3_PA3()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_SD1_DAT3)                      /*!< Set PA3 function to SD1_DAT3            */
#define SET_SD1_DAT3_PG9()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_SD1_DAT3)                      /*!< Set PG9 function to SD1_DAT3            */
#define SET_SD1_DAT3_PJ8()          SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ8MFP_Msk)) | SYS_GPJ_MFP2_PJ8MFP_SD1_DAT3)                      /*!< Set PJ8 function to SD1_DAT3            */
#define SET_SD1_nCD_PA12()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_SD1_nCD)                     /*!< Set PA12 function to SD1_nCD            */
#define SET_SD1_nCD_PA6()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_SD1_nCD)                       /*!< Set PA6 function to SD1_nCD             */
#define SET_SD1_nCD_PE14()          SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_SD1_nCD)                     /*!< Set PE14 function to SD1_nCD            */
#define SET_SD1_nCD_PG15()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_SD1_nCD)                     /*!< Set PG15 function to SD1_nCD            */
#define SET_SPI0_CLK_PA2()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_SPI0_CLK)                      /*!< Set PA2 function to SPI0_CLK            */
#define SET_SPI0_CLK_PB14()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_SPI0_CLK)                    /*!< Set PB14 function to SPI0_CLK           */
#define SET_SPI0_CLK_PB6()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_SPI0_CLK)                      /*!< Set PB6 function to SPI0_CLK            */
#define SET_SPI0_CLK_PD2()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_SPI0_CLK)                      /*!< Set PD2 function to SPI0_CLK            */
#define SET_SPI0_CLK_PF8()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_SPI0_CLK)                      /*!< Set PF8 function to SPI0_CLK            */
#define SET_SPI0_I2SMCLK_PA4()      SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_SPI0_I2SMCLK)                  /*!< Set PA4 function to SPI0_I2SMCLK        */
#define SET_SPI0_I2SMCLK_PB0()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_SPI0_I2SMCLK)                  /*!< Set PB0 function to SPI0_I2SMCLK        */
#define SET_SPI0_I2SMCLK_PB11()     SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_SPI0_I2SMCLK)                /*!< Set PB11 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PB12()     SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SPI0_I2SMCLK)                /*!< Set PB12 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PC14()     SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_SPI0_I2SMCLK)                /*!< Set PC14 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PD13()     SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_SPI0_I2SMCLK)                /*!< Set PD13 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PD14()     SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_SPI0_I2SMCLK)                /*!< Set PD14 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PF10()     SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_SPI0_I2SMCLK)                /*!< Set PF10 function to SPI0_I2SMCLK       */
#define SET_SPI0_I2SMCLK_PG2()      SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_SPI0_I2SMCLK)                  /*!< Set PG2 function to SPI0_I2SMCLK        */
#define SET_SPI0_MISO_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_SPI0_MISO)                     /*!< Set PA1 function to SPI0_MISO           */
#define SET_SPI0_MISO_PB13()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_SPI0_MISO)                   /*!< Set PB13 function to SPI0_MISO          */
#define SET_SPI0_MISO_PD1()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_SPI0_MISO)                     /*!< Set PD1 function to SPI0_MISO           */
#define SET_SPI0_MISO_PF7()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_SPI0_MISO)                     /*!< Set PF7 function to SPI0_MISO           */
#define SET_SPI0_MOSI_PA0()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_SPI0_MOSI)                     /*!< Set PA0 function to SPI0_MOSI           */
#define SET_SPI0_MOSI_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SPI0_MOSI)                   /*!< Set PB12 function to SPI0_MOSI          */
#define SET_SPI0_MOSI_PD0()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_SPI0_MOSI)                     /*!< Set PD0 function to SPI0_MOSI           */
#define SET_SPI0_MOSI_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_SPI0_MOSI)                     /*!< Set PF6 function to SPI0_MOSI           */
#define SET_SPI0_SS_PA3()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_SPI0_SS)                       /*!< Set PA3 function to SPI0_SS             */
#define SET_SPI0_SS_PB15()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_SPI0_SS)                     /*!< Set PB15 function to SPI0_SS            */
#define SET_SPI0_SS_PB7()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_SPI0_SS)                       /*!< Set PB7 function to SPI0_SS             */
#define SET_SPI0_SS_PD3()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_SPI0_SS)                       /*!< Set PD3 function to SPI0_SS             */
#define SET_SPI0_SS_PF9()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_SPI0_SS)                       /*!< Set PF9 function to SPI0_SS             */
#define SET_SPI1_CLK_PA7()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_SPI1_CLK)                      /*!< Set PA7 function to SPI1_CLK            */
#define SET_SPI1_CLK_PB3()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_SPI1_CLK)                      /*!< Set PB3 function to SPI1_CLK            */
#define SET_SPI1_CLK_PC1()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_SPI1_CLK)                      /*!< Set PC1 function to SPI1_CLK            */
#define SET_SPI1_CLK_PD5()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_SPI1_CLK)                      /*!< Set PD5 function to SPI1_CLK            */
#define SET_SPI1_CLK_PH6()          SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH6MFP_Msk)) | SYS_GPH_MFP1_PH6MFP_SPI1_CLK)                      /*!< Set PH6 function to SPI1_CLK            */
#define SET_SPI1_CLK_PH8()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_SPI1_CLK)                      /*!< Set PH8 function to SPI1_CLK            */
#define SET_SPI1_CLK_PI9()          SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_SPI1_CLK)                      /*!< Set PI9 function to SPI1_CLK            */
#define SET_SPI1_I2SMCLK_PA5()      SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_SPI1_I2SMCLK)                  /*!< Set PA5 function to SPI1_I2SMCLK        */
#define SET_SPI1_I2SMCLK_PB1()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_SPI1_I2SMCLK)                  /*!< Set PB1 function to SPI1_I2SMCLK        */
#define SET_SPI1_I2SMCLK_PC4()      SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_SPI1_I2SMCLK)                  /*!< Set PC4 function to SPI1_I2SMCLK        */
#define SET_SPI1_I2SMCLK_PD13()     SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_SPI1_I2SMCLK)                /*!< Set PD13 function to SPI1_I2SMCLK       */
#define SET_SPI1_I2SMCLK_PH10()     SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_SPI1_I2SMCLK)                /*!< Set PH10 function to SPI1_I2SMCLK       */
#define SET_SPI1_I2SMCLK_PH3()      SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_SPI1_I2SMCLK)                  /*!< Set PH3 function to SPI1_I2SMCLK        */
#define SET_SPI1_I2SMCLK_PI6()      SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_SPI1_I2SMCLK)                  /*!< Set PI6 function to SPI1_I2SMCLK        */
