OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_SPI1_MISO_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_SPI1_MISO)                     /*!< Set PB5 function to SPI1_MISO           */
#define SET_SPI1_MISO_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_SPI1_MISO)                     /*!< Set PC3 function to SPI1_MISO           */
#define SET_SPI1_MISO_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_SPI1_MISO)                     /*!< Set PC7 function to SPI1_MISO           */
#define SET_SPI1_MISO_PD7()         SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_SPI1_MISO)                     /*!< Set PD7 function to SPI1_MISO           */
#define SET_SPI1_MISO_PE1()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_SPI1_MISO)                     /*!< Set PE1 function to SPI1_MISO           */
#define SET_SPI1_MISO_PE5()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_SPI1_MISO)                     /*!< Set PE5 function to SPI1_MISO           */
#define SET_SPI1_MISO_PH4()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_SPI1_MISO)                     /*!< Set PH4 function to SPI1_MISO           */
#define SET_SPI1_MISO_PI7()         SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_SPI1_MISO)                     /*!< Set PI7 function to SPI1_MISO           */
#define SET_SPI1_MOSI_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_SPI1_MOSI)                     /*!< Set PB4 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PC2()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_SPI1_MOSI)                     /*!< Set PC2 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_SPI1_MOSI)                     /*!< Set PC6 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PD6()         SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_SPI1_MOSI)                     /*!< Set PD6 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PE0()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_SPI1_MOSI)                     /*!< Set PE0 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_SPI1_MOSI)                     /*!< Set PE4 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PH5()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_SPI1_MOSI)                     /*!< Set PH5 function to SPI1_MOSI           */
#define SET_SPI1_MOSI_PI8()         SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_SPI1_MOSI)                     /*!< Set PI8 function to SPI1_MOSI           */
#define SET_SPI1_SS_PA6()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_SPI1_SS)                       /*!< Set PA6 function to SPI1_SS             */
#define SET_SPI1_SS_PB2()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_SPI1_SS)                       /*!< Set PB2 function to SPI1_SS             */
#define SET_SPI1_SS_PC0()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_SPI1_SS)                       /*!< Set PC0 function to SPI1_SS             */
#define SET_SPI1_SS_PD4()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_SPI1_SS)                       /*!< Set PD4 function to SPI1_SS             */
#define SET_SPI1_SS_PH7()           SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH7MFP_Msk)) | SYS_GPH_MFP1_PH7MFP_SPI1_SS)                       /*!< Set PH7 function to SPI1_SS             */
#define SET_SPI1_SS_PH9()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_SPI1_SS)                       /*!< Set PH9 function to SPI1_SS             */
#define SET_SPI1_SS_PI10()          SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_SPI1_SS)                     /*!< Set PI10 function to SPI1_SS            */
#define SET_SPI2_CLK_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_SPI2_CLK)                    /*!< Set PA10 function to SPI2_CLK           */
#define SET_SPI2_CLK_PA13()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_SPI2_CLK)                    /*!< Set PA13 function to SPI2_CLK           */
#define SET_SPI2_CLK_PE8()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_SPI2_CLK)                      /*!< Set PE8 function to SPI2_CLK            */
#define SET_SPI2_CLK_PG3()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_SPI2_CLK)                      /*!< Set PG3 function to SPI2_CLK            */
#define SET_SPI2_I2SMCLK_PB0()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_SPI2_I2SMCLK)                  /*!< Set PB0 function to SPI2_I2SMCLK        */
#define SET_SPI2_I2SMCLK_PC13()     SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_SPI2_I2SMCLK)                /*!< Set PC13 function to SPI2_I2SMCLK       */
#define SET_SPI2_I2SMCLK_PE12()     SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_SPI2_I2SMCLK)                /*!< Set PE12 function to SPI2_I2SMCLK       */
#define SET_SPI2_I2SMCLK_PG1()      SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_SPI2_I2SMCLK)                  /*!< Set PG1 function to SPI2_I2SMCLK        */
#define SET_SPI2_MISO_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_SPI2_MISO)                   /*!< Set PA14 function to SPI2_MISO          */
#define SET_SPI2_MISO_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SPI2_MISO)                     /*!< Set PA9 function to SPI2_MISO           */
#define SET_SPI2_MISO_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_SPI2_MISO)                     /*!< Set PE9 function to SPI2_MISO           */
#define SET_SPI2_MISO_PG4()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_SPI2_MISO)                     /*!< Set PG4 function to SPI2_MISO           */
#define SET_SPI2_MOSI_PA15()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_SPI2_MOSI)                   /*!< Set PA15 function to SPI2_MOSI          */
#define SET_SPI2_MOSI_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_SPI2_MOSI)                     /*!< Set PA8 function to SPI2_MOSI           */
#define SET_SPI2_MOSI_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_SPI2_MOSI)                   /*!< Set PE10 function to SPI2_MOSI          */
#define SET_SPI2_MOSI_PF11()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_SPI2_MOSI)                   /*!< Set PF11 function to SPI2_MOSI          */
#define SET_SPI2_SS_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_SPI2_SS)                     /*!< Set PA11 function to SPI2_SS            */
#define SET_SPI2_SS_PA12()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_SPI2_SS)                     /*!< Set PA12 function to SPI2_SS            */
#define SET_SPI2_SS_PE11()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_SPI2_SS)                     /*!< Set PE11 function to SPI2_SS            */
#define SET_SPI2_SS_PG2()           SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_SPI2_SS)                       /*!< Set PG2 function to SPI2_SS             */
#define SET_SPI3_CLK_PB11()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_SPI3_CLK)                    /*!< Set PB11 function to SPI3_CLK           */
#define SET_SPI3_CLK_PC10()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_SPI3_CLK)                    /*!< Set PC10 function to SPI3_CLK           */
#define SET_SPI3_CLK_PE4()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_SPI3_CLK)                      /*!< Set PE4 function to SPI3_CLK            */
#define SET_SPI3_CLK_PG6()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_SPI3_CLK)                      /*!< Set PG6 function to SPI3_CLK            */
#define SET_SPI3_I2SMCLK_PB1()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_SPI3_I2SMCLK)                  /*!< Set PB1 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PD14()     SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_SPI3_I2SMCLK)                /*!< Set PD14 function to SPI3_I2SMCLK       */
#define SET_SPI3_I2SMCLK_PE6()      SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_SPI3_I2SMCLK)                  /*!< Set PE6 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PF6()      SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_SPI3_I2SMCLK)                  /*!< Set PF6 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PH4()      SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_SPI3_I2SMCLK)                  /*!< Set PH4 function to SPI3_I2SMCLK        */
#define SET_SPI3_MISO_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_SPI3_MISO)                     /*!< Set PB9 function to SPI3_MISO           */
#define SET_SPI3_MISO_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_SPI3_MISO)                   /*!< Set PC12 function to SPI3_MISO          */
#define SET_SPI3_MISO_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SPI3_MISO)                     /*!< Set PE3 function to SPI3_MISO           */
#define SET_SPI3_MISO_PG7()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_SPI3_MISO)                     /*!< Set PG7 function to SPI3_MISO           */
#define SET_SPI3_MISO_PH0()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_SPI3_MISO)                     /*!< Set PH0 function to SPI3_MISO           */
#define SET_SPI3_MOSI_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_SPI3_MOSI)                     /*!< Set PB8 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_SPI3_MOSI)                   /*!< Set PC11 function to SPI3_MOSI          */
#define SET_SPI3_MOSI_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SPI3_MOSI)                     /*!< Set PE2 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PG8()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_SPI3_MOSI)                     /*!< Set PG8 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PH1()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_SPI3_MOSI)                     /*!< Set PH1 function to SPI3_MOSI           */
#define SET_SPI3_SS_PB10()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_SPI3_SS)                     /*!< Set PB10 function to SPI3_SS            */
#define SET_SPI3_SS_PC9()           SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_SPI3_SS)                       /*!< Set PC9 function to SPI3_SS             */
#define SET_SPI3_SS_PE5()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_SPI3_SS)                       /*!< Set PE5 function to SPI3_SS             */
#define SET_SPI3_SS_PG5()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_SPI3_SS)                       /*!< Set PG5 function to SPI3_SS             */
#define SET_SPIM0_CLKN_PC5()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_SPIM0_CLKN)                    /*!< Set PC5 function to SPIM0_CLKN          */
#define SET_SPIM0_CLK_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_SPIM0_CLK)                     /*!< Set PC4 function to SPIM0_CLK           */
#define SET_SPIM0_D2_PC0()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_SPIM0_D2)                      /*!< Set PC0 function to SPIM0_D2            */
#define SET_SPIM0_D3_PG10()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_SPIM0_D3)                    /*!< Set PG10 function to SPIM0_D3           */
#define SET_SPIM0_D4_PG9()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_SPIM0_D4)                      /*!< Set PG9 function to SPIM0_D4            */
#define SET_SPIM0_D5_PG13()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_SPIM0_D5)                    /*!< Set PG13 function to SPIM0_D5           */
#define SET_SPIM0_D6_PG14()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_SPIM0_D6)                    /*!< Set PG14 function to SPIM0_D6           */
#define SET_SPIM0_D7_PG15()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_SPIM0_D7)                    /*!< Set PG15 function to SPIM0_D7           */
#define SET_SPIM0_MISO_PG12()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_SPIM0_MISO)                  /*!< Set PG12 function to SPIM0_MISO         */
#define SET_SPIM0_MOSI_PG11()       SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_SPIM0_MOSI)                  /*!< Set PG11 function to SPIM0_MOSI         */
#define SET_SPIM0_RESETN_PC2()      SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_SPIM0_RESETN)                  /*!< Set PC2 function to SPIM0_RESETN        */
#define SET_SPIM0_RWDS_PC1()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_SPIM0_RWDS)                    /*!< Set PC1 function to SPIM0_RWDS          */
#define SET_SPIM0_SS_PC3()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_SPIM0_SS)                      /*!< Set PC3 function to SPIM0_SS            */
#define SET_SPIM1_CLKN_PH12()       SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_SPIM1_CLKN)                  /*!< Set PH12 function to SPIM1_CLKN         */
#define SET_SPIM1_CLK_PH13()        SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_SPIM1_CLK)                   /*!< Set PH13 function to SPIM1_CLK          */
#define SET_SPIM1_D2_PJ4()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_SPIM1_D2)                      /*!< Set PJ4 function to SPIM1_D2            */
#define SET_SPIM1_D3_PJ3()          SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_SPIM1_D3)                      /*!< Set PJ3 function to SPIM1_D3            */
#define SET_SPIM1_D4_PH15()         SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_SPIM1_D4)                    /*!< Set PH15 function to SPIM1_D4           */
#define SET_SPIM1_D5_PD7()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_SPIM1_D5)                      /*!< Set PD7 function to SPIM1_D5            */
#define SET_SPIM1_D6_PD6()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_SPIM1_D6)                      /*!< Set PD6 function to SPIM1_D6            */
#define SET_SPIM1_D7_PD5()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_SPIM1_D7)                      /*!< Set PD5 function to SPIM1_D7            */
#define SET_SPIM1_MISO_PJ5()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_SPIM1_MISO)                    /*!< Set PJ5 function to SPIM1_MISO          */
#define SET_SPIM1_MOSI_PJ6()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ6MFP_Msk)) | SYS_GPJ_MFP1_PJ6MFP_SPIM1_MOSI)                    /*!< Set PJ6 function to SPIM1_MOSI          */
#define SET_SPIM1_RESETN_PJ2()      SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_SPIM1_RESETN)                  /*!< Set PJ2 function to SPIM1_RESETN        */
#define SET_SPIM1_RWDS_PH14()       SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_SPIM1_RWDS)                  /*!< Set PH14 function to SPIM1_RWDS         */
#define SET_SPIM1_SS_PJ7()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ7MFP_Msk)) | SYS_GPJ_MFP1_PJ7MFP_SPIM1_SS)                      /*!< Set PJ7 function to SPIM1_SS            */
#define SET_SWDH_CLK_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_SWDH_CLK)                    /*!< Set PA10 function to SWDH_CLK           */
#define SET_SWDH_DAT_PA9()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SWDH_DAT)                      /*!< Set PA9 function to SWDH_DAT            */
#define SET_SWODEC_SWO_PB12()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SWODEC_SWO)                  /*!< Set PB12 function to SWODEC_SWO         */
#define SET_SWODEC_SWO_PC8()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_SWODEC_SWO)                    /*!< Set PC8 function to SWODEC_SWO          */
#define SET_SWODEC_SWO_PF4()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_SWODEC_SWO)                    /*!< Set PF4 function to SWODEC_SWO          */
#define SET_TAMPER0_PF6()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_TAMPER0)                       /*!< Set PF6 function to TAMPER0             */
#define SET_TAMPER1_PF7()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_TAMPER1)                       /*!< Set PF7 function to TAMPER1             */
#define SET_TAMPER2_PF8()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_TAMPER2)                       /*!< Set PF8 function to TAMPER2             */
#define SET_TAMPER3_PF9()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_TAMPER3)                       /*!< Set PF9 function to TAMPER3             */
#define SET_TAMPER4_PF10()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_TAMPER4)                     /*!< Set PF10 function to TAMPER4            */
#define SET_TAMPER5_PF11()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_TAMPER5)                     /*!< Set PF11 function to TAMPER5            */
#define SET_TM0_EXT_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_TM0_EXT)                     /*!< Set PA11 function to TM0_EXT            */
#define SET_TM0_EXT_PB15()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_TM0_EXT)                     /*!< Set PB15 function to TM0_EXT            */
#define SET_TM0_EXT_PF3()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_TM0_EXT)                       /*!< Set PF3 function to TM0_EXT             */
#define SET_TM0_EXT_PH0()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_TM0_EXT)                       /*!< Set PH0 function to TM0_EXT             */
#define SET_TM0_PB5()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_TM0)                           /*!< Set PB5 function to TM0                 */
#define SET_TM0_PC7()               SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_TM0)                           /*!< Set PC7 function to TM0                 */
#define SET_TM0_PG2()               SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_TM0)                           /*!< Set PG2 function to TM0                 */
#define SET_TM1_EXT_PA10()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_TM1_EXT)                     /*!< Set PA10 function to TM1_EXT            */
#define SET_TM1_EXT_PB14()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_TM1_EXT)                     /*!< Set PB14 function to TM1_EXT            */
#define SET_TM1_EXT_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_TM1_EXT)                       /*!< Set PF2 function to TM1_EXT             */
#define SET_TM1_EXT_PH1()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_TM1_EXT)                       /*!< Set PH1 function to TM1_EXT             */
#define SET_TM1_PB4()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_TM1)                           /*!< Set PB4 function to TM1                 */
#define SET_TM1_PB6()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_TM1)                           /*!< Set PB6 function to TM1                 */
#define SET_TM1_PC14()              SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_TM1)                         /*!< Set PC14 function to TM1                */
#define SET_TM1_PC6()               SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_TM1)                           /*!< Set PC6 function to TM1                 */
#define SET_TM1_PG3()               SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_TM1)                           /*!< Set PG3 function to TM1                 */
#define SET_TM2_EXT_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_TM2_EXT)                       /*!< Set PA9 function to TM2_EXT             */
