OpenNuvoton/NuTool-PinConfigure/Header/M55M1/sys.h
#define SET_UART3_RXD_PI15()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_UART3_RXD)                   /*!< Set PI15 function to UART3_RXD          */
#define SET_UART3_TXD_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_UART3_TXD)                   /*!< Set PB15 function to UART3_TXD          */
#define SET_UART3_TXD_PC10()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_UART3_TXD)                   /*!< Set PC10 function to UART3_TXD          */
#define SET_UART3_TXD_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_UART3_TXD)                     /*!< Set PC3 function to UART3_TXD           */
#define SET_UART3_TXD_PD1()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_UART3_TXD)                     /*!< Set PD1 function to UART3_TXD           */
#define SET_UART3_TXD_PE1()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_UART3_TXD)                     /*!< Set PE1 function to UART3_TXD           */
#define SET_UART3_TXD_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_UART3_TXD)                   /*!< Set PE10 function to UART3_TXD          */
#define SET_UART3_TXD_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART3_TXD)                   /*!< Set PE14 function to UART3_TXD          */
#define SET_UART3_TXD_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UART3_TXD)                     /*!< Set PF5 function to UART3_TXD           */
#define SET_UART3_TXD_PI14()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_UART3_TXD)                   /*!< Set PI14 function to UART3_TXD          */
#define SET_UART3_nCTS_PB12()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_UART3_nCTS)                  /*!< Set PB12 function to UART3_nCTS         */
#define SET_UART3_nCTS_PD2()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_UART3_nCTS)                    /*!< Set PD2 function to UART3_nCTS          */
#define SET_UART3_nCTS_PH9()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_UART3_nCTS)                    /*!< Set PH9 function to UART3_nCTS          */
#define SET_UART3_nRTS_PB13()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_UART3_nRTS)                  /*!< Set PB13 function to UART3_nRTS         */
#define SET_UART3_nRTS_PD3()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_UART3_nRTS)                    /*!< Set PD3 function to UART3_nRTS          */
#define SET_UART3_nRTS_PH8()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_UART3_nRTS)                    /*!< Set PH8 function to UART3_nRTS          */
#define SET_UART4_RXD_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_UART4_RXD)                   /*!< Set PA13 function to UART4_RXD          */
#define SET_UART4_RXD_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_UART4_RXD)                     /*!< Set PA2 function to UART4_RXD           */
#define SET_UART4_RXD_PB10()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_UART4_RXD)                   /*!< Set PB10 function to UART4_RXD          */
#define SET_UART4_RXD_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_UART4_RXD)                     /*!< Set PC4 function to UART4_RXD           */
#define SET_UART4_RXD_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UART4_RXD)                     /*!< Set PC6 function to UART4_RXD           */
#define SET_UART4_RXD_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_UART4_RXD)                     /*!< Set PF6 function to UART4_RXD           */
#define SET_UART4_RXD_PG3()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_UART4_RXD)                     /*!< Set PG3 function to UART4_RXD           */
#define SET_UART4_RXD_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_UART4_RXD)                   /*!< Set PH11 function to UART4_RXD          */
#define SET_UART4_RXD_PH3()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_UART4_RXD)                     /*!< Set PH3 function to UART4_RXD           */
#define SET_UART4_RXD_PI13()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_UART4_RXD)                   /*!< Set PI13 function to UART4_RXD          */
#define SET_UART4_TXD_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_UART4_TXD)                   /*!< Set PA12 function to UART4_TXD          */
#define SET_UART4_TXD_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_UART4_TXD)                     /*!< Set PA3 function to UART4_TXD           */
#define SET_UART4_TXD_PB11()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_UART4_TXD)                   /*!< Set PB11 function to UART4_TXD          */
#define SET_UART4_TXD_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_UART4_TXD)                     /*!< Set PC5 function to UART4_TXD           */
#define SET_UART4_TXD_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_UART4_TXD)                     /*!< Set PC7 function to UART4_TXD           */
#define SET_UART4_TXD_PF7()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_UART4_TXD)                     /*!< Set PF7 function to UART4_TXD           */
#define SET_UART4_TXD_PH10()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_UART4_TXD)                   /*!< Set PH10 function to UART4_TXD          */
#define SET_UART4_TXD_PH2()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_UART4_TXD)                     /*!< Set PH2 function to UART4_TXD           */
#define SET_UART4_TXD_PI12()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_UART4_TXD)                   /*!< Set PI12 function to UART4_TXD          */
#define SET_UART4_nCTS_PC8()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_UART4_nCTS)                    /*!< Set PC8 function to UART4_nCTS          */
#define SET_UART4_nCTS_PE1()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_UART4_nCTS)                    /*!< Set PE1 function to UART4_nCTS          */
#define SET_UART4_nCTS_PE14()       SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART4_nCTS)                  /*!< Set PE14 function to UART4_nCTS         */
#define SET_UART4_nRTS_PE0()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_UART4_nRTS)                    /*!< Set PE0 function to UART4_nRTS          */
#define SET_UART4_nRTS_PE13()       SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_UART4_nRTS)                  /*!< Set PE13 function to UART4_nRTS         */
#define SET_UART4_nRTS_PE15()       SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_UART4_nRTS)                  /*!< Set PE15 function to UART4_nRTS         */
#define SET_UART5_RXD_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_UART5_RXD)                     /*!< Set PA4 function to UART5_RXD           */
#define SET_UART5_RXD_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_UART5_RXD)                     /*!< Set PB4 function to UART5_RXD           */
#define SET_UART5_RXD_PE6()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_UART5_RXD)                     /*!< Set PE6 function to UART5_RXD           */
#define SET_UART5_RXD_PF10()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_UART5_RXD)                   /*!< Set PF10 function to UART5_RXD          */
#define SET_UART5_RXD_PH1()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_UART5_RXD)                     /*!< Set PH1 function to UART5_RXD           */
#define SET_UART5_TXD_PA5()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_UART5_TXD)                     /*!< Set PA5 function to UART5_TXD           */
#define SET_UART5_TXD_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_UART5_TXD)                     /*!< Set PB5 function to UART5_TXD           */
#define SET_UART5_TXD_PE7()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_UART5_TXD)                     /*!< Set PE7 function to UART5_TXD           */
#define SET_UART5_TXD_PF11()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_UART5_TXD)                   /*!< Set PF11 function to UART5_TXD          */
#define SET_UART5_TXD_PH0()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_UART5_TXD)                     /*!< Set PH0 function to UART5_TXD           */
#define SET_UART5_nCTS_PB2()        SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_UART5_nCTS)                    /*!< Set PB2 function to UART5_nCTS          */
#define SET_UART5_nCTS_PF8()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_UART5_nCTS)                    /*!< Set PF8 function to UART5_nCTS          */
#define SET_UART5_nCTS_PH3()        SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_UART5_nCTS)                    /*!< Set PH3 function to UART5_nCTS          */
#define SET_UART5_nRTS_PB3()        SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_UART5_nRTS)                    /*!< Set PB3 function to UART5_nRTS          */
#define SET_UART5_nRTS_PF9()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_UART5_nRTS)                    /*!< Set PF9 function to UART5_nRTS          */
#define SET_UART5_nRTS_PH2()        SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_UART5_nRTS)                    /*!< Set PH2 function to UART5_nRTS          */
#define SET_UART6_RXD_PA10()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_UART6_RXD)                   /*!< Set PA10 function to UART6_RXD          */
#define SET_UART6_RXD_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_UART6_RXD)                   /*!< Set PC11 function to UART6_RXD          */
#define SET_UART6_RXD_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UART6_RXD)                     /*!< Set PC6 function to UART6_RXD           */
#define SET_UART6_RXD_PD13()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_UART6_RXD)                   /*!< Set PD13 function to UART6_RXD          */
#define SET_UART6_RXD_PE15()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_UART6_RXD)                   /*!< Set PE15 function to UART6_RXD          */
#define SET_UART6_RXD_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_UART6_RXD)                     /*!< Set PE4 function to UART6_RXD           */
#define SET_UART6_RXD_PG14()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_UART6_RXD)                   /*!< Set PG14 function to UART6_RXD          */
#define SET_UART6_RXD_PH5()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_UART6_RXD)                     /*!< Set PH5 function to UART6_RXD           */
#define SET_UART6_RXD_PJ11()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_UART6_RXD)                   /*!< Set PJ11 function to UART6_RXD          */
#define SET_UART6_TXD_PA11()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_UART6_TXD)                   /*!< Set PA11 function to UART6_TXD          */
#define SET_UART6_TXD_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_UART6_TXD)                   /*!< Set PC12 function to UART6_TXD          */
#define SET_UART6_TXD_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_UART6_TXD)                     /*!< Set PC7 function to UART6_TXD           */
#define SET_UART6_TXD_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART6_TXD)                   /*!< Set PE14 function to UART6_TXD          */
#define SET_UART6_TXD_PE5()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_UART6_TXD)                     /*!< Set PE5 function to UART6_TXD           */
#define SET_UART6_TXD_PG13()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_UART6_TXD)                   /*!< Set PG13 function to UART6_TXD          */
#define SET_UART6_TXD_PH4()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_UART6_TXD)                     /*!< Set PH4 function to UART6_TXD           */
#define SET_UART6_TXD_PJ10()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_UART6_TXD)                   /*!< Set PJ10 function to UART6_TXD          */
#define SET_UART6_nCTS_PC9()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_UART6_nCTS)                    /*!< Set PC9 function to UART6_nCTS          */
#define SET_UART6_nCTS_PE2()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_UART6_nCTS)                    /*!< Set PE2 function to UART6_nCTS          */
#define SET_UART6_nRTS_PC10()       SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_UART6_nRTS)                  /*!< Set PC10 function to UART6_nRTS         */
#define SET_UART6_nRTS_PE3()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_UART6_nRTS)                    /*!< Set PE3 function to UART6_nRTS          */
#define SET_UART7_RXD_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_UART7_RXD)                     /*!< Set PA8 function to UART7_RXD           */
#define SET_UART7_RXD_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_UART7_RXD)                     /*!< Set PB8 function to UART7_RXD           */
#define SET_UART7_RXD_PD8()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_UART7_RXD)                     /*!< Set PD8 function to UART7_RXD           */
#define SET_UART7_RXD_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_UART7_RXD)                     /*!< Set PE2 function to UART7_RXD           */
#define SET_UART7_RXD_PG12()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_UART7_RXD)                   /*!< Set PG12 function to UART7_RXD          */
#define SET_UART7_RXD_PH7()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH7MFP_Msk)) | SYS_GPH_MFP1_PH7MFP_UART7_RXD)                     /*!< Set PH7 function to UART7_RXD           */
#define SET_UART7_RXD_PJ9()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ9MFP_Msk)) | SYS_GPJ_MFP2_PJ9MFP_UART7_RXD)                     /*!< Set PJ9 function to UART7_RXD           */
#define SET_UART7_TXD_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_UART7_TXD)                     /*!< Set PA9 function to UART7_TXD           */
#define SET_UART7_TXD_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_UART7_TXD)                     /*!< Set PB9 function to UART7_TXD           */
#define SET_UART7_TXD_PD9()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_UART7_TXD)                     /*!< Set PD9 function to UART7_TXD           */
#define SET_UART7_TXD_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_UART7_TXD)                     /*!< Set PE3 function to UART7_TXD           */
#define SET_UART7_TXD_PG11()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_UART7_TXD)                   /*!< Set PG11 function to UART7_TXD          */
#define SET_UART7_TXD_PH6()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH6MFP_Msk)) | SYS_GPH_MFP1_PH6MFP_UART7_TXD)                     /*!< Set PH6 function to UART7_TXD           */
#define SET_UART7_TXD_PJ8()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ8MFP_Msk)) | SYS_GPJ_MFP2_PJ8MFP_UART7_TXD)                     /*!< Set PJ8 function to UART7_TXD           */
#define SET_UART7_nCTS_PE4()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_UART7_nCTS)                    /*!< Set PE4 function to UART7_nCTS          */
#define SET_UART7_nCTS_PH5()        SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_UART7_nCTS)                    /*!< Set PH5 function to UART7_nCTS          */
#define SET_UART7_nRTS_PE5()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_UART7_nRTS)                    /*!< Set PE5 function to UART7_nRTS          */
#define SET_UART7_nRTS_PH4()        SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_UART7_nRTS)                    /*!< Set PH4 function to UART7_nRTS          */
#define SET_UART8_RXD_PD10()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_UART8_RXD)                   /*!< Set PD10 function to UART8_RXD          */
#define SET_UART8_RXD_PE0()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_UART8_RXD)                     /*!< Set PE0 function to UART8_RXD           */
#define SET_UART8_RXD_PE15()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_UART8_RXD)                   /*!< Set PE15 function to UART8_RXD          */
#define SET_UART8_RXD_PJ1()         SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ1MFP_Msk)) | SYS_GPJ_MFP0_PJ1MFP_UART8_RXD)                     /*!< Set PJ1 function to UART8_RXD           */
#define SET_UART8_RXD_PJ5()         SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_UART8_RXD)                     /*!< Set PJ5 function to UART8_RXD           */
#define SET_UART8_TXD_PD11()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_UART8_TXD)                   /*!< Set PD11 function to UART8_TXD          */
#define SET_UART8_TXD_PE1()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_UART8_TXD)                     /*!< Set PE1 function to UART8_TXD           */
#define SET_UART8_TXD_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART8_TXD)                   /*!< Set PE14 function to UART8_TXD          */
#define SET_UART8_TXD_PJ0()         SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ0MFP_Msk)) | SYS_GPJ_MFP0_PJ0MFP_UART8_TXD)                     /*!< Set PJ0 function to UART8_TXD           */
#define SET_UART8_TXD_PJ4()         SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_UART8_TXD)                     /*!< Set PJ4 function to UART8_TXD           */
#define SET_UART8_nCTS_PC13()       SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_UART8_nCTS)                  /*!< Set PC13 function to UART8_nCTS         */
#define SET_UART8_nCTS_PE3()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_UART8_nCTS)                    /*!< Set PE3 function to UART8_nCTS          */
#define SET_UART8_nCTS_PI14()       SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_UART8_nCTS)                  /*!< Set PI14 function to UART8_nCTS         */
#define SET_UART8_nCTS_PJ2()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_UART8_nCTS)                    /*!< Set PJ2 function to UART8_nCTS          */
#define SET_UART8_nRTS_PD12()       SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_UART8_nRTS)                  /*!< Set PD12 function to UART8_nRTS         */
#define SET_UART8_nRTS_PE2()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_UART8_nRTS)                    /*!< Set PE2 function to UART8_nRTS          */
#define SET_UART8_nRTS_PI15()       SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_UART8_nRTS)                  /*!< Set PI15 function to UART8_nRTS         */
#define SET_UART8_nRTS_PJ3()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_UART8_nRTS)                    /*!< Set PJ3 function to UART8_nRTS          */
#define SET_UART9_RXD_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_UART9_RXD)                     /*!< Set PE4 function to UART9_RXD           */
#define SET_UART9_RXD_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_UART9_RXD)                     /*!< Set PF2 function to UART9_RXD           */
#define SET_UART9_RXD_PF8()         SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_UART9_RXD)                     /*!< Set PF8 function to UART9_RXD           */
#define SET_UART9_RXD_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_UART9_RXD)                   /*!< Set PH11 function to UART9_RXD          */
#define SET_UART9_RXD_PH13()        SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_UART9_RXD)                   /*!< Set PH13 function to UART9_RXD          */
#define SET_UART9_RXD_PH2()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_UART9_RXD)                     /*!< Set PH2 function to UART9_RXD           */
